[
    {
      "author": "Yeoh Sheng Ze",
      "scholarship": "Yayasan Khazanah Scholarship",
      "year": 2024,
      "question": [
        "Tell us something about yourself and your experiences that is especially important or meaningful to you.",
        "Please describe major challenges or hardships encountered in life and how you overcame them.",
        "Describe how have you contributed to your community using clear examples to support your answer.",
        "Explain how your education will play a role in your career and overall goals after graduation."
      ],
      "essay": [
        "As the youngest son in a family of four, I grew up surrounded by love and music. I started playing the piano at the age of four and later on picked up the guitar in secondary school. Besides music, reading and playing basketball are also my favourite pastimes. From a young age, the value of serving the community has been instilled in me by my parents, which led me to serve in the prefectorial board throughout secondary school. In addition to that, I am also a volunteer of Akar Umbi Society, a non-profit organisation working closely with the grassroots to develop stronger communities through people-development programmes and initiatives.",
        "My commitment towards community service deepened when I came across an article on how stroke rehabilitation for patients was affected by the Movement Control Order. Having had a grandfather who suffered from the same condition, the article resonated deeply with me. I couldn’t help but feel empathetic towards those in similar situations. Driven by empathy and the desire to help the community, it set off the journey of my science project! Collaborating with a friend, we embarked on a journey to explore the possibility of artificial intelligence-assisted home-based rehabilitation exercises. My first close encounter with machine learning in the project was fun but required a lot of understanding and learning.",
        "May 2022 marked a significant milestone as my teammate and I were selected to represent Malaysia at the Regeneron International Science and Engineering Fair (ISEF) in Atlanta. It was indeed an eye-opening experience as ISEF is the globe's biggest pre-college science fair, attracting more than 1,800 high school students from 75 countries annually. While coping with jet lag, we braved through five rounds of judging sessions during the three-day fair. Then came the award ceremony. As our names were announced as the 1st grand award winner of the Robotics and Intelligent Machines category, we stood up in disbelief. Much to our surprise, we were also selected among all the 1st grand award winners of the various categories to receive the European Union Contest for Young Scientists Award and to represent Regeneron ISEF at the EU Contest for Young Scientists held in Leiden, Netherlands later that year. It was truly a great honour and recognition! Standing on the stage, I was immersed in a surge of joy, gratitude and immense pride for making Malaysia, our school, and family proud.",
        "As for me, the greatest gift lies within the journey. From brainstorming, researching for relevant information, writing proposals, designing and carrying out the project experiments, collecting data till writing up the report, the entire process took almost 8 months. There were many weekends of repeating the same procedures countless times to collect sufficient dataset for analysis purposes. Without perseverance, one would have been discouraged and distracted throughout this long journey. We were not spared from failures and bottlenecks in the process. There were frustrating moments when the prototype did not perform as intended leading to inconsistent readings. Discussions, troubleshooting, and seeking advice from our mentor had helped us cross the hurdles and march on. I have learnt to face challenges with calmness and determination. Being focused and sometimes thinking outside the box helps in finding solutions to hurdle the obstacles met.",
        "Being the living testament of how support and guidance can lead to tremendous growth, I have made it my mission to pass on my legacy. As the president of the Catholic High School Robotic Club in 2023, I shouldered the responsibility of paving the way for juniors. I collaborated with my committees to organise and implement core activities such as EV3 and Arduino classes. Furthermore, I worked closely with the advisor to look for qualified coaches to nurture the young talents. Training programmes at different levels were devised to prepare members for competition exposures to enhance their experiences and skills. As a result of the initiatives, 7 international awards were won that year, among them the Champion of Junior Future Innovators category of World Robot Olympiad 2023 Panama and Gold medal in World Robot Games 2023 Taipei. A great sense of accomplishment and fulfillment arose from within as I watched them grow and triumph.",
        "From a greenhorn in science projects to creating a positive impact in the school community, the learning process has been nothing short of humbling and enriching. These experiences have shown me the importance of education and exposure in grooming a talent. As an aspiring data scientist, I am strongly motivated to pursue global tertiary education in a leading university for the opportunities to learn from the best of the best, gaining exposure to the cutting-edge technologies such as artificial intelligence and machine learning as well as forging friendships with other young bright minds. The learning opportunities will help prepare me to be a competent and proficient data scientist to better serve my nation in the future. It would truly be a great honour and privilege to be part of the committed Khazanah team in delivering impactful and sustainable outcomes to the nation through the initiatives of ADVANCING MALAYSIA. Striving to stay at the forefront of the ever-changing landscape of technologies in data science, I am committed to being a lifelong learner, embodying the Chinese proverb: “Learning is like sailing on a boundless sea, set ashore only by diligence.”"
      ]
    },
    {
      "author": "Tan Wen Bin",
      "scholarship": "Yayasan Khazanah Scholarship",
      "year": 2024,
      "question": [
        "Tell us something about yourself and your experiences that is especially important or meaningful to you.",
        "Please describe major challenges or hardships encountered in life and how you overcame them.",
        "Describe how have you contributed to your community using clear examples to support your answer.",
        "Explain how your education will play a role in your career and overall goals after graduation.",
        "For Postgraduate candidates, please explain in detail the area of your research that you wish to pursue."
      ],
      "essay": [
        "“When one door closes, another opens”. This quote resonates deeply with me. At 12, I discovered I have red-green colour deficiency. It felt like a door had closed on me as I couldn't pursue my dream as a pilot. I started learning about colourblindness and how people cope with it. I found out Mark Zuckerberg has the same condition. His achievements reminded me being colourblind doesn’t limit my full potential. It’s only as significant as I allow it to be.",
        "Yet, there were moments of disappointments. I could vividly remember a Chemistry experiment where I struggled to interpret the results on pH papers due to my ‘handicap’. However, with the invaluable help from teachers and classmates, I was able to overcome it. Obtaining a driver's license is more troublesome for me as well, as I have to undergo thorough examinations. I’m blessed with supportive parents who have always been there no matter what.",
        "Over the years, I explored passions that aren’t restricted by my condition. In 2020, I participated in Johor SDG Challenge. I was exposed to Sustainable Development Goals and the pressing issues our world faces, some hit close to home. My team focused on SDG3: Good-Health-and-Well-being. Through Google Forms, we discovered one out of 20 students in my school was obese. We collaborated with canteen to restrict on the sale of fried-food and canned-drinks, replacing them with healthier alternatives like vegetables. Additionally, we partnered with our counselling team to organize talks promoting healthy lifestyles and balanced diets stipulated in Food Pyramid. We won the first prize at state-level. The most rewarding part was seeing how we could make a world of difference. Even after the competition had ended, our canteen continues to expand the selection of vegetables as there was fervent support from teachers. It made me proud, and I finally understood the underlying principle of Mother Teresa’s quote, “What we're doing is nothing more than a drop in the ocean, but if the drop weren’t there, the ocean would be missing something.” This discovery has taught me that action is the key to unlocking the door to success. This is a principle I cling onto each time I face challenges and overcome adversities.",
        "In 2022, I took a part-time job, where I was responsible for inputting data for PCR-tests. This was a huge responsibility as accurate data was essential to track the spread of COVID-19. However, in pursuit of completing the tasks quickly, I didn’t double-check the entries before submitting. This oversight could have caused workers to be quarantined unnecessarily for two weeks. I had to call the doctor-in-charge to delete the entries. Despite being reprimanded, I learnt to embrace responsibility for my actions. As I pave my way to adulthood, I'm no longer shielded by my parents but instead, I have to learn to hold myself accountable. It's only through accountability that will make my learning from setbacks easier while remaining honest about my actions to strive for excellence.",
        "During CNY2022, I coordinated my school’s celebration. It was my first time coordinating an event. I enlisted the help of six classmates, and we planned activities that would entertain our peers. I delegated tasks to each member based on their strengths. As the leader, I took on additional responsibilities. One of which was contacting my primary school’s lion dance team and convincing them to perform. This required several meetings and painstaking planning. With the help of teacher, I secured sponsorships to give Mandarin-oranges to every student. Every day, I conducted meetings with my teammates to keep track of our progress and ensure they had all the necessary resources. The most rewarding part was seeing the smiles on everyone’s faces. As much as the world is becoming increasingly autonomous, we cannot achieve our goals on our own. It enhanced my project-management skills and taught me about teamwork and clear-communication, laying a solid foundation for my future endeavours.",
        "While researching about AI, I stumbled upon a video showcasing AlphaGo playing Go against the world champion and securing a 4-1 victory. I realized the potential of AI in tackling complex problems while creating solutions. That’s when I found my new interest – Artificial Intelligence. As my knowledge about AI deepened, I began exploring how AI could help others facing similar challenges. Inspired by the support I've received, I aspire to develop AI-application that will help colourblind individuals differentiate colours. For instance, this application could be especially useful for science students like me, who need to identify colour during experiments. An AI-powered app can analyse the visual input from experiments and display colour information in a way that is easily understandable for colourblind individuals. For those with more severe colourblindness, AI could analyze fruits to determine ripeness or help with tasks like matching clothing and interpreting traffic-lights. I aspire to spread awareness about colourblindness to help others understand our needs and challenges.",
        "Reflecting on Malaysia’s experience during COVID-19, it’s crucial to improve our healthcare system. Malaysia has managed the crisis relatively well, partly due to the rapid development of vaccines. By integrating AI, researchers were able to shorten the development timeframe of vaccines and thus, saving millions of lives. As of now, Malaysia has to rely on foreign expertise for vaccine supply, and vaccine hoarding by rich nations had slowed down Malaysia’s vaccination efforts. Prevention is better than cure, and it’s time Malaysia invested more in leveraging AI within its healthcare system. After graduation, I’m keen on collaborating with biologists, pharmacists, virologists, and AI experts to lead in the R&D of drugs. This proactive approach will better prepare Malaysia for future health crises.",
        "Every experience I’ve undergone has shaped me into a more resilient, determined, and diligent person. I’ve also developed valuable soft skills such as effective communication, teamwork, and leadership. These qualities and exposures are precisely why I believe I’m a deserving candidate for the scholarship. I’m committed to giving back to Malaysia and contributing to Khazanah's mission of investing the country's funds in impactful and far-reaching businesses."
      ]
    },
    {
        "author": "Tan Wen Bin",
        "scholarship": "Bank Negara Malaysia Scholarship",
        "year": 2024,
        "question": [
          "Imagine having a conversation with your favorite teacher regarding potential scholarship offers.",
          "Explain why Bank Negara Malaysia would be your choice of scholarship and how your chosen field of study will be beneficial to you and Bank Negara Malaysia.",
          "Please also explain a significant personal experience which shaped who you are as a person."
        ],
        "essay": [
          "“Will AI create more jobs or otherwise?” I believe AI increases job opportunities. For example, BNM could leverage AI to analyze large datasets to forecast economic trends such as GDP growth, unemployment rates, and inflation. As the technology is still in its infancy, this will create more job opportunities for AI engineers to develop more advanced models.",
          "“Sounds like you’re interested in the banking industry. Have you applied for Kijang Scholarship?”",
          "Yes! As the central bank of Malaysia, BNM plays a crucial role in ensuring Malaysia’s economic stability and development. BNM is responsible for formulating economic policies, and each decision has far-reaching implications for Malaysia. In fact, being part of BNM has always been my dream. What’s exciting is the opportunity to contribute my abilities in ways that benefit all levels of society. This is where my actions will have the most impact.",
          "“AI is transforming industries worldwide, and banking is no exception. How will your future expertise in AI benefit BNM?”",
          "While AI has experienced exponential growth, we have only scratched the surface of what’s possible. As AI continues advancing, this field will remain relevant for years to come. In the banking industry, AI could be used to analyze market data and trends to provide investment insights. Upon graduation, I aspire to collaborate with AI experts, data scientists, and economists at BNM to develop economic policies that address problems like depreciation of the ringgit and income inequality while analyzing the effectiveness of a progressive wage policy.",
          "“That’s very insightful. Seems like you’ve thought this through. Is there a particular experience that has influenced your decision to pursue AI?”",
          "Yes, indeed! In 2022, I took a job inputting data for PCR tests. This was a huge responsibility as accurate data was essential to track the spread of COVID-19. However, in pursuit of completing the tasks quickly, I didn’t double-check the entries before submitting. This oversight could have caused workers to be quarantined unnecessarily. This experience made me realize the potential of AI in automating time-consuming tasks such as data entry and compliance checks. This not only reduces human error but also allows BNM to focus on more important aspects."
        ]
      }
  ]
  