[
  {
    "author": "Jordan Lee Fur Yuan",
    "scholarship": "Yayasan Khazanah Scholarship",
    "year": 2024,
    "question": [
        "Tell us something about yourself and your experiences that is especially important or meaningful to you.",
        "Please describe major challenges or hardships encountered in life and how you overcome them.",
        "Describe how have you contributed to your community using clear examples to support your answer.",
        "Explain how your education will play a role in your career and overall goals after graduation."
    ],
    "essay": [
        "Throughout 17 years of my life, the many things I learnt through experiences and hardships have shaped who I am today. If you asked what three words best describe me? I would tell you that I am sensible, caring and an ambitious person. I live by the principles of becoming a better person every day, and to challenge myself to learn, grow and realise my full potential.",
        "Since young, I have been a role model to my peers as I consistently got good grades, was sociable with schoolmates, teachers and participated actively in sports. All I could say was that I didn’t feel like I had to put any pressure on myself to accomplish my goals; everything felt extremely natural to me. I became the head prefect at the age of 12, competed in multiple Olympiad maths competitions, and made the first team in the school’s football club.",
        "One day, I was selected to compete in (what I initially believed to be) yet another competition, where I made it through the preliminary rounds and was called up to an interview. I sat on the red-padded chair, my feet dangling, palms sweaty, staring at the 2 grown-ups who were informing me about the possibilities of furthering my studies abroad. “No, I’m, not ready,” were the words that came out of my mouth, and shortly after, I was led away from the room. Unaware of my actions, I was drawn to my mother’s disapproving expression and the uncomfortable drive home. I was not old enough to understand the severity and rarity of this opportunity. That was when I lost out on Singapore’s ASEAN Scholarship.",
        "As I got older and realised the mistake I had made, I promised myself to never let another chance pass me by. Additionally, I have finally come to understand the saying “if opportunity doesn’t knock, build a door”. I will always strive to do better so that I can create my own opportunities and this time I will definitely hold onto them. Thus, this application serves as tangible evidence of my ability to seize a chance. This experience also made me become more sensible moving forward. I will always consider the bigger picture and what is at stake to avoid making the wrong decision that could negatively impact not only me but also those around me.",
        "I felt optimistic and hopeful as I entered young adulthood. Similar to my primary school days, I was still consistently receiving high grades, and was sociable with my classmates. Nothing changed until my mother enrolled me for private IGCSE tuition after school. I always felt unfair that although some of my peers were spared from this experience, I wasn’t. After almost a year or so, I was still struggling to balance between my school syllabus and my IGCSE syllabus, but the MCO phase began. I grabbed this opportunity and took advantage of all the free time and worked hard for my IGCSE.",
        "After 2 arduous but productive years of being confined at home, I felt more secure about my academic abilities and soon came my IGCSE final exams in the middle of my form 4 school year. I still had to finish my homework while burying myself in stacks and stacks of past papers while my other friends had loads of fun during Form 4 as SPM seemed like a lightyear away. 16-year-old me suddenly felt the need to perform well academically and also participate actively in extracurricular activities. Nevertheless, I persevered and completed my IGCSE exams in May ‘23. I also became President of the school’s Harmonica and Guitar Band for the term 2022/2023.",
        "In the end, I felt proud of myself for being able to achieve a great deal more than I anticipated. However, right now I face one of my toughest obstacle; myself. Despite years of hard work, and my eligibility for college my parents still insisted on me continuing with the government syllabus. It was burnout, confusion, lack of motivation and rationale. I barely passed my school’s midterm paper and still lack the determination to continue studying for SPM. Involving myself in extracurricular activities and the club’s issues was a means of escaping my own problems. I needed to change the way I was thinking. I started to make myself understand that IGCSE was just another challenge to prove that I can achieve so much more if I put in the work and time. Ultimately, my efforts are for my own benefit. I learnt to not put too much pressure on myself, as SPM, and high school is just a small part of my life and I just have to take life one step at a time.",
        "With this new positive outlook and mentality on life, I learnt that there is much more to life than academic success. With this newfound optimism and self-improvement mindset, I’m gradually finding joy in pursuing my interest and doing things to improve myself. Having said that, my passion for animals led me to pursue employment as an animal shelter promoter after SPM. I collected donations and informed people about the efforts the animal shelter has made to help stray and abandoned animals. Seeing people from various social and economic backgrounds provide a helping hand out of a shared love for animals, made me recognise how much I love Malaysia and our community.",
        "Therefore, In civil engineering I see a purposeful and versatile career, and yet what I love most about it is being able to contribute back to my country by being the building blocks of my nation. Moreover, without a doubt that this scholarship is a chance to attain global exposure on civil engineering and a strong education would be a solid start to facilitate this progress.",
        "With all things considered, I acknowledge that this is the path I want for myself, no matter the challenges I may face; nevertheless, once given the opportunity, I know I have the right mentality and motivation to become successful in this fulfilling career."
    ]
},
    {
      "author": "Yeoh Sheng Ze",
      "scholarship": "Yayasan Khazanah Scholarship",
      "year": 2024,
      "question": [
        "Tell us something about yourself and your experiences that is especially important or meaningful to you.",
        "Please describe major challenges or hardships encountered in life and how you overcame them.",
        "Describe how have you contributed to your community using clear examples to support your answer.",
        "Explain how your education will play a role in your career and overall goals after graduation."
      ],
      "essay": [
        "As the youngest son in a family of four, I grew up surrounded by love and music. I started playing the piano at the age of four and later on picked up the guitar in secondary school. Besides music, reading and playing basketball are also my favourite pastimes. From a young age, the value of serving the community has been instilled in me by my parents, which led me to serve in the prefectorial board throughout secondary school. In addition to that, I am also a volunteer of Akar Umbi Society, a non-profit organisation working closely with the grassroots to develop stronger communities through people-development programmes and initiatives.",
        "My commitment towards community service deepened when I came across an article on how stroke rehabilitation for patients was affected by the Movement Control Order. Having had a grandfather who suffered from the same condition, the article resonated deeply with me. I couldn’t help but feel empathetic towards those in similar situations. Driven by empathy and the desire to help the community, it set off the journey of my science project! Collaborating with a friend, we embarked on a journey to explore the possibility of artificial intelligence-assisted home-based rehabilitation exercises. My first close encounter with machine learning in the project was fun but required a lot of understanding and learning.",
        "May 2022 marked a significant milestone as my teammate and I were selected to represent Malaysia at the Regeneron International Science and Engineering Fair (ISEF) in Atlanta. It was indeed an eye-opening experience as ISEF is the globe's biggest pre-college science fair, attracting more than 1,800 high school students from 75 countries annually. While coping with jet lag, we braved through five rounds of judging sessions during the three-day fair. Then came the award ceremony. As our names were announced as the 1st grand award winner of the Robotics and Intelligent Machines category, we stood up in disbelief. Much to our surprise, we were also selected among all the 1st grand award winners of the various categories to receive the European Union Contest for Young Scientists Award and to represent Regeneron ISEF at the EU Contest for Young Scientists held in Leiden, Netherlands later that year. It was truly a great honour and recognition! Standing on the stage, I was immersed in a surge of joy, gratitude and immense pride for making Malaysia, our school, and family proud.",
        "As for me, the greatest gift lies within the journey. From brainstorming, researching for relevant information, writing proposals, designing and carrying out the project experiments, collecting data till writing up the report, the entire process took almost 8 months. There were many weekends of repeating the same procedures countless times to collect sufficient dataset for analysis purposes. Without perseverance, one would have been discouraged and distracted throughout this long journey. We were not spared from failures and bottlenecks in the process. There were frustrating moments when the prototype did not perform as intended leading to inconsistent readings. Discussions, troubleshooting, and seeking advice from our mentor had helped us cross the hurdles and march on. I have learnt to face challenges with calmness and determination. Being focused and sometimes thinking outside the box helps in finding solutions to hurdle the obstacles met.",
        "Being the living testament of how support and guidance can lead to tremendous growth, I have made it my mission to pass on my legacy. As the president of the Catholic High School Robotic Club in 2023, I shouldered the responsibility of paving the way for juniors. I collaborated with my committees to organise and implement core activities such as EV3 and Arduino classes. Furthermore, I worked closely with the advisor to look for qualified coaches to nurture the young talents. Training programmes at different levels were devised to prepare members for competition exposures to enhance their experiences and skills. As a result of the initiatives, 7 international awards were won that year, among them the Champion of Junior Future Innovators category of World Robot Olympiad 2023 Panama and Gold medal in World Robot Games 2023 Taipei. A great sense of accomplishment and fulfillment arose from within as I watched them grow and triumph.",
        "From a greenhorn in science projects to creating a positive impact in the school community, the learning process has been nothing short of humbling and enriching. These experiences have shown me the importance of education and exposure in grooming a talent. As an aspiring data scientist, I am strongly motivated to pursue global tertiary education in a leading university for the opportunities to learn from the best of the best, gaining exposure to the cutting-edge technologies such as artificial intelligence and machine learning as well as forging friendships with other young bright minds. The learning opportunities will help prepare me to be a competent and proficient data scientist to better serve my nation in the future. It would truly be a great honour and privilege to be part of the committed Khazanah team in delivering impactful and sustainable outcomes to the nation through the initiatives of ADVANCING MALAYSIA. Striving to stay at the forefront of the ever-changing landscape of technologies in data science, I am committed to being a lifelong learner, embodying the Chinese proverb: “Learning is like sailing on a boundless sea, set ashore only by diligence.”"
      ]
    },
    {
      "author": "Tan Wen Bin",
      "scholarship": "Yayasan Khazanah Scholarship",
      "year": 2024,
      "question": [
        "Tell us something about yourself and your experiences that is especially important or meaningful to you.",
        "Please describe major challenges or hardships encountered in life and how you overcame them.",
        "Describe how have you contributed to your community using clear examples to support your answer.",
        "Explain how your education will play a role in your career and overall goals after graduation.",
        "For Postgraduate candidates, please explain in detail the area of your research that you wish to pursue."
      ],
      "essay": [
        "“When one door closes, another opens”. This quote resonates deeply with me. At 12, I discovered I have red-green colour deficiency. It felt like a door had closed on me as I couldn't pursue my dream as a pilot. I started learning about colourblindness and how people cope with it. I found out Mark Zuckerberg has the same condition. His achievements reminded me being colourblind doesn’t limit my full potential. It’s only as significant as I allow it to be.",
        "Yet, there were moments of disappointments. I could vividly remember a Chemistry experiment where I struggled to interpret the results on pH papers due to my ‘handicap’. However, with the invaluable help from teachers and classmates, I was able to overcome it. Obtaining a driver's license is more troublesome for me as well, as I have to undergo thorough examinations. I’m blessed with supportive parents who have always been there no matter what.",
        "Over the years, I explored passions that aren’t restricted by my condition. In 2020, I participated in Johor SDG Challenge. I was exposed to Sustainable Development Goals and the pressing issues our world faces, some hit close to home. My team focused on SDG3: Good-Health-and-Well-being. Through Google Forms, we discovered one out of 20 students in my school was obese. We collaborated with canteen to restrict on the sale of fried-food and canned-drinks, replacing them with healthier alternatives like vegetables. Additionally, we partnered with our counselling team to organize talks promoting healthy lifestyles and balanced diets stipulated in Food Pyramid. We won the first prize at state-level. The most rewarding part was seeing how we could make a world of difference. Even after the competition had ended, our canteen continues to expand the selection of vegetables as there was fervent support from teachers. It made me proud, and I finally understood the underlying principle of Mother Teresa’s quote, “What we're doing is nothing more than a drop in the ocean, but if the drop weren’t there, the ocean would be missing something.” This discovery has taught me that action is the key to unlocking the door to success. This is a principle I cling onto each time I face challenges and overcome adversities.",
        "In 2022, I took a part-time job, where I was responsible for inputting data for PCR-tests. This was a huge responsibility as accurate data was essential to track the spread of COVID-19. However, in pursuit of completing the tasks quickly, I didn’t double-check the entries before submitting. This oversight could have caused workers to be quarantined unnecessarily for two weeks. I had to call the doctor-in-charge to delete the entries. Despite being reprimanded, I learnt to embrace responsibility for my actions. As I pave my way to adulthood, I'm no longer shielded by my parents but instead, I have to learn to hold myself accountable. It's only through accountability that will make my learning from setbacks easier while remaining honest about my actions to strive for excellence.",
        "During CNY2022, I coordinated my school’s celebration. It was my first time coordinating an event. I enlisted the help of six classmates, and we planned activities that would entertain our peers. I delegated tasks to each member based on their strengths. As the leader, I took on additional responsibilities. One of which was contacting my primary school’s lion dance team and convincing them to perform. This required several meetings and painstaking planning. With the help of teacher, I secured sponsorships to give Mandarin-oranges to every student. Every day, I conducted meetings with my teammates to keep track of our progress and ensure they had all the necessary resources. The most rewarding part was seeing the smiles on everyone’s faces. As much as the world is becoming increasingly autonomous, we cannot achieve our goals on our own. It enhanced my project-management skills and taught me about teamwork and clear-communication, laying a solid foundation for my future endeavours.",
        "While researching about AI, I stumbled upon a video showcasing AlphaGo playing Go against the world champion and securing a 4-1 victory. I realized the potential of AI in tackling complex problems while creating solutions. That’s when I found my new interest – Artificial Intelligence. As my knowledge about AI deepened, I began exploring how AI could help others facing similar challenges. Inspired by the support I've received, I aspire to develop AI-application that will help colourblind individuals differentiate colours. For instance, this application could be especially useful for science students like me, who need to identify colour during experiments. An AI-powered app can analyse the visual input from experiments and display colour information in a way that is easily understandable for colourblind individuals. For those with more severe colourblindness, AI could analyze fruits to determine ripeness or help with tasks like matching clothing and interpreting traffic-lights. I aspire to spread awareness about colourblindness to help others understand our needs and challenges.",
        "Reflecting on Malaysia’s experience during COVID-19, it’s crucial to improve our healthcare system. Malaysia has managed the crisis relatively well, partly due to the rapid development of vaccines. By integrating AI, researchers were able to shorten the development timeframe of vaccines and thus, saving millions of lives. As of now, Malaysia has to rely on foreign expertise for vaccine supply, and vaccine hoarding by rich nations had slowed down Malaysia’s vaccination efforts. Prevention is better than cure, and it’s time Malaysia invested more in leveraging AI within its healthcare system. After graduation, I’m keen on collaborating with biologists, pharmacists, virologists, and AI experts to lead in the R&D of drugs. This proactive approach will better prepare Malaysia for future health crises.",
        "Every experience I’ve undergone has shaped me into a more resilient, determined, and diligent person. I’ve also developed valuable soft skills such as effective communication, teamwork, and leadership. These qualities and exposures are precisely why I believe I’m a deserving candidate for the scholarship. I’m committed to giving back to Malaysia and contributing to Khazanah's mission of investing the country's funds in impactful and far-reaching businesses."
      ]
    },
    {
        "author": "Tan Wen Bin",
        "scholarship": "Bank Negara Malaysia Scholarship",
        "year": 2024,
        "question": [
          "Imagine having a conversation with your favorite teacher regarding potential scholarship offers.",
          "Explain why Bank Negara Malaysia would be your choice of scholarship and how your chosen field of study will be beneficial to you and Bank Negara Malaysia.",
          "Please also explain a significant personal experience which shaped who you are as a person."
        ],
        "essay": [
          "“Will AI create more jobs or otherwise?” I believe AI increases job opportunities. For example, BNM could leverage AI to analyze large datasets to forecast economic trends such as GDP growth, unemployment rates, and inflation. As the technology is still in its infancy, this will create more job opportunities for AI engineers to develop more advanced models.",
          "“Sounds like you’re interested in the banking industry. Have you applied for Kijang Scholarship?”",
          "Yes! As the central bank of Malaysia, BNM plays a crucial role in ensuring Malaysia’s economic stability and development. BNM is responsible for formulating economic policies, and each decision has far-reaching implications for Malaysia. In fact, being part of BNM has always been my dream. What’s exciting is the opportunity to contribute my abilities in ways that benefit all levels of society. This is where my actions will have the most impact.",
          "“AI is transforming industries worldwide, and banking is no exception. How will your future expertise in AI benefit BNM?”",
          "While AI has experienced exponential growth, we have only scratched the surface of what’s possible. As AI continues advancing, this field will remain relevant for years to come. In the banking industry, AI could be used to analyze market data and trends to provide investment insights. Upon graduation, I aspire to collaborate with AI experts, data scientists, and economists at BNM to develop economic policies that address problems like depreciation of the ringgit and income inequality while analyzing the effectiveness of a progressive wage policy.",
          "“That’s very insightful. Seems like you’ve thought this through. Is there a particular experience that has influenced your decision to pursue AI?”",
          "Yes, indeed! In 2022, I took a job inputting data for PCR tests. This was a huge responsibility as accurate data was essential to track the spread of COVID-19. However, in pursuit of completing the tasks quickly, I didn’t double-check the entries before submitting. This oversight could have caused workers to be quarantined unnecessarily. This experience made me realize the potential of AI in automating time-consuming tasks such as data entry and compliance checks. This not only reduces human error but also allows BNM to focus on more important aspects."
        ]
      },
      {
        "author": "Bryan Ngu Zhu Kiet",
        "scholarship": "Yayasan UEM Scholarship",
        "year": 2024,
        "question": [
          "Describe a time in your life that has shaped who you are as a person. (Maximum of 300 words)"
        ],
        "essay": [
          "A time in my life that has shaped who I am as a person was in Form 4 when I was elected as the Prefect Council of Multimedia. Throughout the year, my potential was discovered and I learned life lessons. Being one of the assistants of the head prefect, I was responsible for leading the team of prefects during the orientation program and interview sessions. After each duty, I also needed to brief them, providing feedback on what went well and what could be improved before dismissing them. As a result, I built my confidence and led the prefects in boosting their aplomb. It improved my communication skills and I could communicate well with the prefects from diverse backgrounds.",
          "Besides, I learned to think critically about various problems we face in organizing events such as orientation programmes and analyze the best possible solution in the circumstances. I like to coordinate with my teammates to achieve our goals and make our event a success.",
          "Moreover, I learned how to control the PA system, Bluetooth microphones and the projector in the hall. I needed to make every assembly and activity either in the hall or in the theatre smooth. It was quite hard at first but soon I embraced the failure and learned to be resilient. That was the time when my interest towards computer science grew intensely in my heart. Hence, I started undertaking CS50: Introduction to Computer Science, an online course that is taught at Harvard University and I am now willing to pursue a Data Science degree at a renowned university in the world due to my strong passion for math and computing! So, here I am!"
        ]
      },      
      {
        "author": "Bryan Ngu Zhu Kiet",
        "scholarship": "Yayasan UEM Scholarship",
        "year": 2024,
        "question": [
          "I am applying for Yayasan UEM Scholarship because…. (Maximum of 300 words)"
        ],
        "essay": [
          "I am deeply passionate about mathematics and computer science so I wish to pursue a Data Science degree at a renowned university in the world. This scholarship would serve as a stepping stone towards realizing my professional goals, enabling me to deepen my knowledge and expertise in specialized areas such as data mining and machine learning. What’s more, this scholarship connects recipients with influential individuals, mentors or organisations. Hence, obtaining this scholarship would not only have a significant impact on my academic and professional endeavours but also my personal growth. As UEM Group always stand on the frontline to reach out to the needy and is actively involved in community services such as UEM ALERT volunteers and Emergency Relief Mission, I believe that this scholarship would allow me to participate in community service initiatives and help me develop a sense of social responsibility.",
          "Furthermore, by receiving the scholarship, I will be exposed to cutting-edge research and technologies besides gaining insights into successful systems and frameworks implemented in other countries. As a result, I can make substantial contributions to my own country, Malaysia after my further studies. I aim to leverage advanced analytical tools and techniques to help predict energy demand fluctuations by analyzing historical data on energy consumption, weather patterns, economic activity and social factors. For instance, optimising the operation of renewable energy plants, such as adjusting the tilt of solar panels to maximize sun exposure, will undeniably reduce carbon emissions, thus minimizing environmental impacts and helping achieve the target of Net Zero Carbon by 2050. Moreover, I aim to develop a machine learning model to analyse financial data and help UEM Group by forecasting future market trends and consumer behaviour. This will lead to accurate decisions to be made or the benefits of economic growth and societal values."
        ]
      },
      {
        "author": "Bryan Ngu Zhu Kiet",
        "scholarship": "Yayasan Khazanah Scholarship",
        "year": 2024,
        "question": [
            "Tell us something about yourself and your experiences that is especially important or meaningful to you.",
            "Please describe major challenges or hardships encountered in life and how you overcome them.",
            "Describe how have you contributed to your community using clear examples to support your answer.",
            "Explain how your education will play a role in your career and overall goals after graduation."
        ],
        "essay": [
            "“He said one day you’ll leave this world behind, so live a life you will remember.” This lyric of “The Nights” by Avicii has always been my favourite motto to live by, reminding me to live my life to the fullest, accept the way I am, and figure out what I am most passionate about in life. So, here I am! My name is Bryan Ngu, a top student at SMK Sacred Heart with a strong passion for mathematics and computing, wishing to pursue a Data Science degree at a renowned university in the world. Since I was young, I have involved myself in a lot of competitions such as chess, calligraphy, drawing, Olympiad Math, table tennis, robotics, and soon I found that I was very interested in both Olympiad Math and robotics.",
            "When I was in primary three, I was amazed by the seniors transforming a pile of LEGO EV3 components into a complicated robot car, where it could move itself on a designated map! My mouth opened wide agape when I saw them programming using the EV3 Programmer App and that was the time when my interest towards artificial intelligence grew intensely in my heart. Then, I joined the robotics club and trained hard with my teammates, we even stayed up late in school until 10 pm discussing strategies and ultimately, our team qualified as the Top 10 team in the National Robotics Competition! After SPM, I learned programming language which is C by undertaking CS50: Introduction to Computer Science, an online course on computer science taught at Harvard University. I found that solving problems using computational and critical thinking skills gives me a sense of satisfaction. I also figure out different ways to solve mathematical problems using programming language to stimulate different ways of thinking. I believe that I am always prepared for self-improvement by investing myself in learning new things because these small and regular efforts count.",
            "Being a table tennis coach is the most meaningful experience in my life. Transitioning into a coaching role after SPM allowed me to share my passion for the sport while making a difference in the lives of young athletes. Before becoming a part-time coach, I was worried that I might not perform my best so I sought advice from experienced coaches and did extensive research day and night, including watching YouTube videos on coaching strategies for children. Time flies, those determined kids trained hard and showed remarkable improvement in their skills, stamina and mindset. Certainly, my hope for them is aligned with Yayasan Khazanah’s aspiration, to groom the next generation of leaders who have the potential to redefine the future and make substantial contributions to our country!",
            "The major challenge encountered in life was during my time in Form 4, I was elected as a prefect council of multimedia. In October, the teacher asked for a volunteer to prepare a 200-page PPT for the grand ceremony, Speech Day and I decided to take it up as a challenge. When I started working on the task, I realized that I had underestimated how long it was going to take me to complete it. I had to commit extra hours to get the job finished on time. Then, I reached out to a friend, Kelvin to help me type in all the names and I was responsible for making the PPT colourful and inserting videos and audio. I also watched YouTube videos on how to make my PPT look more attractive and finally, we spent about 5 days completing the work. Fortunately, everything went smoothly and the PA system was well-controlled on Speech Day.",
            "To be frank, I wasn’t involved in a lot of community services in high school as I was fully occupied with academic and co-curricular activities. However, I enjoy volunteering whenever possible as there is so much joy in serving people. Helping someone in need is definitely our Malaysian culture! Hence, I created a Telegram Channel “SPM Scholarships and Courses” to share information about scholarships, courses and tips to ace the interviews. My motivation is just simple: I believe in the power of education and I shoulder the responsibility to ensure my friends, who are future leaders, do not miss out on a golden opportunity which could change their entire life. It is rewarding and uplifting as I can make a difference in the world. Therefore, I sincerely hope that I can have more chances to reach out to more needy in future. As Yayasan Khazanah’s scholarship provides scholars with volunteering opportunities with non-governmental and non-profit making bodies, I wish that I can be awarded this scholarship to embrace charity and empower my community!",
            "Malaysia is heading towards becoming a developed and technology-based country, therefore it is important to absorb talents that are well exposed to the development of the technology and the nation. As a student with a strong passion and skillset in computing and mathematics, I believe that I can cope well with the trend. Over the next decade, I aim to pursue a Data Science degree and certifications, deepening my knowledge and expertise in specialized areas such as data mining and machine learning. My long-term goal includes leveraging advanced analytical tools and techniques to organize data brilliantly and this will enable precise interpretation of the data. For instance, I aim to develop a machine learning model to analyse financial data and help Khazanah Nasional Berhad by forecasting future market trends and consumer behaviour. This will lead to accurate decisions to be made or the benefits of economic growth and societal values. As artificial intelligence is in the vogue now, I am positive that AI will be implemented in investment decision-making in the near future, and Data Science will become one of the very important foundations. Therefore, it is my wish to become a Data Scientist and to serve Khazanah Nasional Berhad and the nation after my further studies. I am confident that I will strive for my best to achieve the goal of ‘Advancing Malaysia’!"
        ]
    },
    {
      "author": "Sean Liaw Chong Ye",
      "scholarship": "Yayasan Khazanah Scholarship",
      "year": 2024,
      "question": [
          "Tell us something about yourself and your experiences that is especially important or meaningful to you.",
          "Please describe major challenges or hardships encountered in life and how you overcome them.",
          "Describe how have you contributed to your community using clear examples to support your answer.",
          "Explain how your education will play a role in your career and overall goals after graduation."
      ],
      "essay": [
          "I was born in China. Naturally, I often go back to my hometown. Each time I went back, I always witnessed staggering developments there, from infrastructure to the network of public transport the city has to offer. With mathematics, algorithms can be created to help with scheduling these public transport. Analyzing the population distribution can help with determining the frequency of a bus or metro line required every day. This is what Malaysia needs.",
          "In 2022, I had the opportunity to participate in the Fully Residential School International Symposium. It was then that I was exposed to the United Nations Sustainable Development Goals (SDG). We had to prepare a presentation revolving around the 11th goal of being sustainable cities and communities. I had not made a public presentation before, let alone on the international level. Getting nervous was common. I had to step out of my comfort zone. I consistently practised the speech, getting the timing right and making it as flawless as possible. By joining this symposium, I managed to hit multiple birds with one stone. I became aware of the SDGs, became more confident about speaking in public, found my passion in the world of debating and speaking, and developed a burning desire to contribute to society by spreading the wisdom of these goals with methods to achieve them. This is the turning point of my life.",
          "This experience eventually led me to join the debate team. Through the lens of debating, I learned about differences in perspectives on various issues. I captured the idea of quick analysis to build strong arguments and rebuttals. I became more aware of current issues, ranging from local to global prospects. It was also through debate that I learned how to accept losing. In the past, I hated losing. The bitter pill of losing, whether in academic achievements or competitions, was always a hard pill to swallow for me. But through debating, I gradually learned how to accept defeat and move on. Chinese has an ancient saying, ‘There are mountains beyond mountains, there are people beyond people.’ This reflects the fact that there are always people who are better than you. Debating made me more resilient in life, developed quick thinking abilities, and became more open to opinions different from mine.",
          "I volunteered at a children's holiday acting camp a few years ago. I had to deal with the daily welfare of the children, from serving them meals to cleaning the toilets. Not to mention, I also had to handle a group of children and guide them through the activities. Through this experience, I learned how to interact with people of different attitudes and characters. I improved my communication skills greatly through this volunteering experience.",
          "The exposure to the 11th SDG made me ponder upon the state of our nation. How far exactly are we to achieving this goal? Sustainable cities and communities are directly related to the usage of public transport and fossil fuels. However, in Malaysia, we face problems such as public transport being only widely available in concentrated population cities and the lack of support towards the usage of public transport. The World Bank reported that in 2014, there were approximately 210 registered private motor cars per 100 inhabitants in Kuala Lumpur, making it 2 private cars per person. With the help of mathematics, models can be created to predict peak-hour situations and adjust public transport schedules based on those algorithms. This can help minimize wait times and improve the overall commuter experience. The mathematics model can be a key contributor to assisting bus companies in determining the most efficient route to reduce carbon footprints while making the most of each bus travel. Not to mention, the usage of Electric Vehicles (EVs) can be further promoted when Mathematics can design algorithms that can determine how to utilise the chargings of EVs and make the best use of renewable energy sources. These examples became a driving force for me to pursue my dreams in Mathematics.",
          "If an opportunity is bestowed upon me, I will take part and be a key contributor to society to align with the SDGs. I want to be a part of sectors that have the potential to emerge in Malaysia and make our nation more sustainable. These ideas also align with Khazanah’s purpose. With my desire to pursue Mathematics, it is possible to make Malaysia just as amazing as how China is now. My experiences in life have made me more equipped to face more challenges in the future. Mathematics is a powerful tool, one that can make noble changes to Malaysia, allowing the country to progress and prosper."
      ]
  },
  {
    "author": "Sean Liaw Chong Ye",
    "scholarship": "Bank Negara Malaysia Scholarship",
    "year": 2024,
    "question": [
      "Imagine having a conversation with your favorite teacher regarding potential scholarship offers.",
      "Explain why Bank Negara Malaysia would be your choice of scholarship and how your chosen field of study will be beneficial to you and Bank Negara Malaysia.",
      "Please also explain a significant personal experience which shaped who you are as a person."
    ],
    "essay": [
        "For five years, I was the only Chinese student at Banting Science School. It was a life-changing experience that broadened my horizons and reinforced my appreciation for people from different backgrounds and cultures. During this period, I carefully observed my peers' particular financial habits. In contrast to students from higher-income households, I found that students from lower-income homes tend to be more frugal. This led to my interest in economics and finance, as I reflected on the importance of financial security on the well-being of individuals and society as a whole. Since entering high school, I have consistently ranked at the top of my batch, driven by an unwavering dedication to my studies. This commitment was fueled by my aspiration to pursue finance and economics in higher education.",
        "Bank Negara Malaysia, as the backbone of Malaysia’s economy, offers me an unparalleled opportunity to contribute to the stability and development of the nation. The prospect of pursuing education overseas is exciting, as it is a dream of mine to be part of an environment that exposes me to in-depth, cutting-edge research and ideas that can contribute to my personal growth. Additionally, the internships offered by BNM would provide invaluable experiences in understanding economic growth and financial stability in Malaysia.",
        "The economy is the lifeblood of a nation’s strength. By studying economics, I will develop a nuanced understanding of economic principles and financial systems. My participation in the Fully Residential School International Symposium, where I learned about the United Nations Sustainable Development Goals (SDGs), highlighted the crucial need for inclusive financial policies. This experience allowed me to further analyze the significance of sustainable practices in financial institutions as a way to promote long-term economic stability.",
        "As a Bank Negara Malaysia scholar, I want to connect with individuals who share the same passion for creating economic resilience in Malaysia with the support of BNM. For example, I want to contribute to discussions that provide in-depth analysis and forecasts of Malaysia’s economy. Ultimately, like other BNM scholars, I aim to help build a financially resilient and sustainable Malaysia for the long term. Choosing the Kijang Scholarship is a strategic decision that aligns with my academic and career aspirations."
    ]
},
  {
    "author": "Muhammad Umar Mohamad Nadzrie",
    "scholarship": "Yayasan Telekom Malaysia",
    "year": 2024,
    "question": [
        "Tell us something about yourself and your experiences that is especially important or meaningful to you.",
        "Please describe major challenges or hardships encountered in life and how you overcome them.",
        "Describe how have you contributed to your community using clear examples to support your answer.",
        "Explain how your education will play a role in your career and overall goals after graduation."
    ],
    "essay": [
        "Living in the city of Melaka, my parents started a humble and loving family, giving birth to four children. Currently, my mother is the breadwinner of the family because my father has been unemployed since Covid-19 struck the world. Being the second child of a middle-class family has made me realise that I have a huge responsibility to set good examples for my younger siblings to become successful in the future.",
        "I believe that the character I have shaped as a person today is the main reason why I am a strong candidate for this scholarship. Having experience in various positions requiring management skills, such as the Chief Editor of the school's magazine team and the Quartermaster of the school's orchestra, has shaped me into someone capable of excelling in academics despite having a busy schedule. My aim is that the skills I have learned and gained from this experience will serve me well in my future career endeavours.",
        "As someone who has dreamed of getting into cybersecurity, I believe my skills would be a great proposition for Malaysia as this is one of the professions most sought after by large companies today to protect their data. Apart from that, data has shown that cybersecurity will be one of the careers that will stay relevant in the next few decades. That is to say, my chosen field of study will not go to waste, and there will be job opportunities waiting for me in the future."
    ]
}
      
      
  ]
  