[
  {
    "id": "petronas",
    "name": "PETRONAS Powering Knowledge Education Sponsorship (PESP)",
    "shortName": "PETRONAS",
    "description": "Since 1975, Petronas has awarded education sponsorships to more than 36,000 deserving students of high academic calibre who dare to push boundaries with a performance mindset and leadership capabilities, to pursue undergraduate studies to prestigious universities either globally or locally. This continues to be pursued by PETRONAS, which focuses on nurturing the right talent that will ultimately contribute to the growth of the company, industry and nation. Upon graduation, PESP scholars will also enjoy the privilege to work with PETRONAS which provides them with many career opportunities, ranging from engineering to management which are relevant to its business operation.",
    "logoPlaceholder": "/assets/company_logos/Petronas_logo.jpg",
    "scholarshipLevel": "global",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Malaysian Citizen aged between 17 - 19 years old during year of application",
        "Possess strong leadership skills and active participation (demonstrable) in extra-curricular activities",
        "Have high integrity and humility",
        "Not presently holding other scholarships/loans"
      ],
      "academicQualifications": [
        "UTP (Computing/Engineering): Minimum 8A- including Chemistry, Physics, and Mathematics",
        "Local Universities (Arts): Minimum 8A- including Mathematics",
        "Overseas Universities (Science/Engineering): Minimum 4A+ and 4A- including Chemistry, Physics, and Mathematics",
        "Overseas Universities (Arts/Computing): Minimum 4A+ and 4A- including Mathematics"
      ]
    },
    "requiredDocuments": [
      "Copy of applicant's IC and parents' IC (Certified True Copy)",
      "SPM results (Certified True Copy)",
      "Extra Co-curricular certificates (Certified True Copy)",
      "PAJSK Certificate (Certified True Copy)",
      "Parents' or Guardians' Salary Slip / EA form (Certified True Copy)",
      "Statutory Declaration (if any of your parents are unemployed/retired) (Certified True Copy)"
    ],
    "coursesOffered": {
      "UTP": [
        "Chemical Engineering",
        "Electrical & Electronic Engineering",
        "Mechanical Engineering",
        "Petroleum Engineering",
        "Petroleum Geoscience"
      ],
      "Overseas": [
        "Applied Chemistry",
        "Chemical Engineering",
        "Mechanical Engineering",
        "Electrical Engineering",
        "Instrumentation Engineering",
        "Geoscience / Geology / Geophysics",
        "Petroleum Engineering",
        "Accounting / Finance",
        "Economics / Business Admin / International Business",
        "Marketing",
        "IT / Software Engineering / Computer Science",
        "Data Science / Data Engineering",
        "Actuarial Science",
        "Sociology / Psychology",
        "Law",
        "Mathematics",
        "Statistics",
        "Software Engineering"
      ]
    },
    "countriesOffered": {
      "Global": [
        "United States",
        "United Kingdom",
        "Australia",
        "New Zealand",
        "China",
        "Japan",
        "South Korea"
      ],
      "Local": [
        "Universiti Teknologi PETRONAS",
        "Universiti Malaya",
        "Universiti Kebangsaan Malaysia",
        "Universiti Putra Malaysia",
        "Universiti Utara Malaysia",
        "Curtin University",
        "Swinburne University",
        "University of Nottingham Malaysia",
        "Sunway University",
        "Heriot-Watt University Malaysia",
        "University of Wollongong Malaysia"
      ]
    },
    "bondingDetails": {
      "duration": "1:1 Study duration to bonding duration",
      "workLocation": null,
      "repaymentConditions": null
    },
    "applicationTimeline": {
      "startDate": "May 20, 2024",
      "endDate": "June 5, 2024",
      "note": "One week before SPM results to one week after SPM results"
    },
    "numberOfRecipients": {
      "local": 400,
      "overseas": 200,
      "total": 600,
      "note": "Approximately 600 successful recipients (200 overseas, 400 local)"
    },
    "applicationLink": "https://educationsponsorship.petronas.com.my/OAS",
    "resultNotification": [
      "An SMS will be sent to notify applicants that the application results are readily available in the official website. There will also be emails to notify applicants regarding details of assessment and interview."
    ],
    "applicationProcess": [
      {
        "stage": "Stage 1: Application Stage",
        "details": "This stage will be open for applicants to apply starting from the day when SPM result is announced. Take note of the application deadline and submit your application form before that. Prepare every information and document required to apply for the scholarship as stated in the guideline.",
        "tips": [
          "Monitor the SPM result announcement date and set a reminder for the application deadline.",
          "Gather all required documents in advance, such as academic transcripts, certificates, and identification.",
          "Carefully read the application guidelines to avoid missing any important steps or details."
        ]
      },
      {
        "stage": "Stage 2: Personality and Cognitive Assessment",
        "details": "This stage aims to assess candidates' personality and cognitive abilities, focusing on problem-solving and critical-thinking skills. Conducted through an online platform, this assessment allows applicants to demonstrate their ability to think critically and come up with solutions quickly.",
        "tips": [
          "Complete the assessment in a conducive environment where distractions are minimized.",
          "Ensure a stable internet connection and a fully charged device to avoid technical issues.",
          "Stay calm and focused during the assessment to perform at your best."
        ]
      },
      {
        "stage": "Stage 3: Student Potential Assessment (SPA)",
        "details": "The final stage in which applicants are required to participate in face-to-face interviews with staffs from PETRONAS. As PETRONAS emphasises on candidates’ leadership and interpersonal skills, there will be two rounds of presentation which enable the interviewers to seek for the candidates that possess the qualities that they are finding for.",
        "tips": [
          "The first round, after a short introduction session, is an individual presentation which candidates will be given around 15 minutes to prepare for a 5-to-8-minute long presentation for a given prompt.",
          "The second round is a group discussion session revolving around the same topic as the previous round. This is the time when candidates can truly showcase their leadership skills. After that, there might be a Q&A session with the interviewers if there are plenty of time left.",
          "During the group discussion, balance asserting your opinions with listening to others to demonstrate leadership and teamwork.",
          "Prepare examples of past leadership experiences to share if asked during the Q&A session. Good luck, future scholars!"
        ]
      }
    ],
    "contactEmail": "edu_sponsorship@petronas.com.my",
    "scholars": [
      {
        "contributorName": "Yeoh Sheng Ze",
        "contributorImage": "/assets/portrait/Sheng_Ze.jpg",
        "intendedCourse": "Mathematics / Statistics (Data Science)",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "i_am_not_shengze",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImages": [
          "/assets/resume/sheng_ze_resume1.jpg",
          "/assets/resume/sheng_ze_resume2.jpg"
        ],
        "stories": [
          {
            "title": "Mock-up Interview Questions and Answers",
            "content": [
              "1. Please introduce yourself.",
              "Answer: I am Yeoh Sheng Ze, passionate about Mathematics and Statistics with aspirations to work in data science.",
              "2. Which country do you want to go? Locally or abroad? Why?",
              "Answer: I prefer studying in the UK as it offers cutting-edge research and exposure to advanced systems in data science."
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "Being cohesive and able to collaborate with others.",
              "Ability to streamline your thoughts and deliver your ideas appropriately."
            ]
          },
          {
            "title": "Advice and Tips to Share with Your Juniors",
            "content": [
              "Stay informed of the latest global affairs.",
              "Prepare data and statistics to support your statements.",
              "Understand the company’s vision and mission.",
              "Practice how you deliver ideas."
            ]
          }
        ]
      },
      {
        "contributorName": "Sarvintirran Parthiban",
        "contributorImage": "/assets/portrait/Sarvin.jpg",
        "intendedCourse": "Electrical Engineering",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "sarvin_tirran",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Answers",
            "content": [
              "1. Please introduce yourself (name, course applied, local or abroad, etc.).",
              "2. The next other questions are regarding case studies which are to be answered individually and in a group."
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "Interview:",
              "1. Be modest and avoid exaggeration of yourself.",
              "2. Be honest and comfortable to agree and disagree with points. This shows that you are really engaged in conversations and feel free to share personal thoughts.",
              "3. Stay calm and do not stutter. Be clear with your points even though they could be wrong. This exudes confidence and gives a good reputation.",
              "4. Maintain a good posture and always smile. This also shows a good impression for interviewers.",
              "5. Dress well and stay sanitary."
            ]
          },
          {
            "title": "Advice and Tips to Share with Your Juniors",
            "content": [
              "i) Study scholarship bodies' websites or social media accounts. Acknowledge their initiatives and implement them in your interviews.",
              "ii) Understand the company's goals and think about how you can help them achieve those goals.",
              "iii) Just be calm and chill 😎. Don't exasperate yourselves before the interview. Don't treat the interview as an interview but treat it as a group conversation and have a good time ;)"
            ]
          }
        ]
      },
      {
        "contributorName": "Soo Jian Xing",
        "contributorImage": "/assets/portrait/soo_img.jpg",
        "intendedCourse": "Accounting and Finance",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "same_jx",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Answers",
            "content": [
              "Introduce yourself.",
              "What do you know about our organisation?",
              "What is your opinion towards xxx?",
              "Why did you choose this course?",
              "What makes you deserve this scholarship?"
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "Be honest and just be yourself. Do not try to impress the interviewers by boasting about your achievements too much because many candidates who have successfully made it to the last stage are just as good as you are, if not more."
            ]
          },
          {
            "title": "Advice and Tips to Share with Your Juniors",
            "content": [
              "Be yourself. Answer the questions honestly; do not try to lie or impress the interviewers by saying something that you know is illogical or impossible to achieve as of now.",
              "Do your research. This is definitely one of the most crucial parts of the interview. A candidate who does his/her research says a lot about his/her personality. The interviewers can tell if you are well prepared for the interview from the way you relate your answers with information that is relevant to the organisation.",
              "Be confident. If you can make it to the stages, you are already more successful than most of the candidates who did not! Do not have low self-esteem just because your achievements are not as marvellous as other people's! Remember you have spent 5 years building the fundamentals, and it's time to move forward instead of looking back at your past achievements.",
              "Prepare for mock interviews. Make a list of questions that you think might come out in the interview. Remember, the effort you put in today can make a huge difference tomorrow!",
              "Get sufficient sleep before assessment/interview. THIS IS ABSOLUTELY VITAL! You must get sufficient sleep the day before you do any assessment or go for an interview. Having sufficient sleep ensures you think critically the next day and maximises your performance. A wise man once said, better to be safe than sorry; you would not want to cry in regret when you get rejected because you performed poorly in the interview due to insufficient quality sleep!"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "shell",
    "name": "Shell Malaysia Scholarship",
    "shortName": "Shell",
    "description": "The Shell Scholarship Programme provides successful applicants with the chance to pursue undergraduate studies in global top-tier universities while participating in mentoring and internship programmes. Upon graduation, scholars will have the opportunity to embark on a fulfilling career in various engineering, geosciences, and commercial disciplines across the organisation’s business operations.",
    "logoPlaceholder": "/assets/company_logos/Shell_logo.png",
    "scholarshipLevel": "global",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Strong leadership skills and active participation in extracurricular activities such as societies and clubs, sports, etc.",
        "Not presently holding other scholarships/loans",
        "Consistently strong academic achievements",
        "Minimum 8As (A/A+) in Sijil Pelajaran Malaysia (SPM) OR Excellent O-level grades at IGCSE (A*/A)",
        "Before applying, ensure you are eligible to work in the country where the scholarship program is offered.",
        "Willing to pursue A-levels at a selected boarding institution"
      ]
    },
    "requiredDocuments": [
      "SPM/IGCSE result slips",
      "Certificates (certified true copy)",
      "Resume (Shell requires a resume)"
    ],
    "coursesOffered": [
      "Engineering: Mechanical, Civil, Chemical, Petroleum, Electrical & Electronics, Environmental, Sustainable",
      "Sciences: Geology, Geosciences, Geomatics, Geophysics, Data Science",
      "Commercial: Business & Management, Digital Marketing"
    ],
    "bondingDetails": {
      "duration": "5 years",
      "workLocation": "Shell Malaysia",
      "repaymentConditions": null
    },
    "applicationTimeline": {
      "startDate": "May 27, 2024",
      "endDate": "June 17, 2024"
    },
    "numberOfRecipients": {
      "2024": null,
      "2023": null
    },
    "applicationLink": "https://www.shell.com.my/careers/students-and-graduates/scholarships.html",
    "resultNotification": [
      "Online application stage: via Email",
      "Virtual Job Tryout and ODVI stage: via Phone Call (at any time by a Shell officer)",
      "Phone Call stage: via Email",
      "Competency-Based Interview stage: Congratulatory phone call"
    ],
    "applicationProcess": [
      {
        "stage": "Stage 1: Online Application",
        "details": "Prepare your resume ahead of time. Personal tips to prepare a resume:",
        "tips": [
          "i) Easy on the eyes: Format your CV in a presentable manner such that it is easily read by a 3rd party (check line spacing, font type and size consistency). This indicates a degree of professionalism.",
          "ii) Quality > quantity - list out your best achievements and try to detail the experience (e.g. 3rd place out of how many participants, level of participation, organiser etc).",
          "iii) Try to display diversity in your ECAs - If possible, try not to saturate your CV with just 1 type of activity. Diversify your portfolio to indicate that you can be an all-rounder to some extent. (e.g. sports, languages, volunteering, etc)"
        ]
      },
      {
        "stage": "Stage 2: Virtual Job Tryout and On-Demand Video Interview (ODVI)",
        "details": "This stage must be completed within 7 days of receiving the invitation. Virtual Job Tryout consists of a personality test and competency test. Both are untimed.",
        "tips": [
          "i) Personality Test",
          "The answers are not black-and-white right or wrong. Most answers are morally grey so this boils down to your innate personality.",
          "The test will rephrase the exact same questions in a multitude of ways, they are trying to see whether you are consistent in your answers. So try to be consistent in your answers.",
          "Don’t lie in questions like “I have never told a lie” or “I have never broken a promise” because who hasn’t?",
          "Display the best version of yourself, however it is perfectly okay to indicate flaws in a personality test.",
          "ii) Competency Test",
          "This test is just assessing how well you understand and apply instructions in a variety of work situations. This should be fairly doable as long as you meticulously read the instructions",
          "iii) Video Interview Maximum duration to answer each question is 2 minutes.",
          "Tips: Draft your answer and rerecord till you are fully satisfied with the video, Fix your audio. Try to make sure your audio device produces a clear and crisp voice, as opposed to a muffled voice."
        ]
      },
      {
        "stage": "Stage 3: Phone Call",
        "details": "You may receive a call from Shell if you advance to this stage. Shell does not notify candidates in advance, so be prepared for an unexpected call. The officer will reference your CV and ask about your achievements and experiences.",
        "tips": [
          "Be conversational! Mine was quite chill because I treated it like a normal conversation. However, prepare draft answers for generic questions. (p.s. don’t memorise interview answers word-by-word, just bullet points!)",
          "Remember what you wrote in your CV! The officer will reference your achievements/participations in your CV and question you about these experiences."
        ]
      },
      {
        "stage": "Stage 4: Competency-Based Interview",
        "details": "Congratulations for making it this far! Shell’s application process is extremely competitive, so be proud of yourself for being shortlisted for the final interview. This is a virtual interview lasting approximately 1 hour with the Scholarship Board of Trustees.",
        "tips": [
          "Use the STAR method to talk about your experiences, and add on what you learnt from that experience as well. Look up CAR or Capacity, Achievement, and Relationships on their website which is the criteria Shell uses to evaluate candidates. https://www.shell.com/careers/candidate-resource-centre/four-ways-to-stand-out-as-a-candidate.html",
          "Again, be conversational! Personally, I think my interview went well because my answers sounded genuine. By the end of the interview, I was just chatting with them about their careers at Shell and I was thoroughly interested in the conversation",
          "It is okay to take a few seconds to consider the question and formulate your response, instead of blurting it out instantaneously.",
          "Try not to be monotonous in your tone, make eye contact with the interviewers, make hand gestures from time to time.",
          "Online interviews can be tiring for the interviewers, so make your interview memorable for them!",
          "Prepare questions for them regarding Shell. They might ask you whether you have any questions for them at the end. You an ask about careers at Shell, the sponsorship programme, anything to indicate that you have interest in working at Shell. Okay done yapping😌"
        ]
      }
    ],
    "contactEmail": "careers@shell.com",
    "scholars": [
      {
        "contributorName": "Liyana Mohammed Rafidz",
        "contributorImage": "/assets/portrait/Liyana.jpg",
        "intendedCourse": "Data Science",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "liyana_rafidz",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImages": [
          "/assets/resume/liyana_resume1.jpg",
          "/assets/resume/liyana_resume2.jpg"
        ],
        "stories": [
          {
            "title": "Mock-up Interview Questions and Answers",
            "content": [
              "Tell me about a time or situation you displayed leadership.",
              "Situation: My school participated in the Malaysian National Schools Debating Championship 2023, a prestigious national debate competition for secondary schools in Malaysia.",
              "Task: We entered the competition as a relatively new team, facing formidable opponents from established schools in the national scene. As the president of our debate club, I was determined to use my leadership and debating experience to help the team succeed and uplift our school’s name in the circuit.",
              "Action: As team captain, I drew on my experience in competitive debating to strategically train the team. For instance, I organised after-school mock debates and joint research sessions, and communicated with our teacher advisor and the Guru Penolong Kanan Kokurikulum to secure our training time and location.",
              "Result: Despite my own nerves, I focused on building team cohesion and instilling confidence in ourselves before and throughout the competition. After six gruelling rounds of intense debates, we made it to the Grand Finals and were awarded Runner-Up. It was one of the happiest moments of my life and taught me the importance of strong team bonds and unwavering determination amidst tough competition.",
              "Sample questions:",
              "1. Talk about a time where you had to work in a diverse environment/team.",
              "2. Talk about a time where you didn't succeed. How did you handle that situation?",
              "3. Talk about a time where you had to juggle multiple commitments at once."
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "1. Keep track of your participation/achievements as you make your way through high school (with relevant certificates as proof) as it will be useful in crafting your resume. If you don't have a resume ready, try to get working on it early. ",
              "2. Thoroughly research the sponsorship bodies. Personally, reading the 2023 annual reports from Shell really helped me get a rough overview of Shell's global operations, their goals and values.",
              "3. Create a scholarship spreadsheet to track deadlines, login information etc. It can get hectic during the application season!"
            ]
          },
          {
            "title": "Advice and Tips for Juniors",
            "content": [
              "1. Try to do mock interviews with family members/friends. Practicing the content of your answers and the WAY you phrase your answers is incredibly important. ",
              "2. Don't feel discouraged from applying to scholarships if you feel your academics or ECAs are not 'exemplary' enough. Scholarships care a lot about personal character and vision from an individual, as well as the knowledge/values you gain from your experiences.",
              "3. In group interviews, be a leader when there is none, and spice the discussion up if there are many! You can take the opportunity to step up as a leader if no one seems to be leading the group, or contribute meaningfully if your group members are all very active. Don't fight other candidates for the spot of the 'leader'. Scholarships value people who can be good team leaders AND team players."
            ]
          }
        ]
      },
      {
        "contributorName": "Muhammad Danish Deniel",
        "contributorImage": "/assets/portrait/Danish_Deniel.jpeg",
        "intendedCourse": "Engineering",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "danishhdeniel",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Answers",
            "content": [
              "1. Please introduce yourself.",
              "Answer: Hi, my name is Danish Deniel. I was born and raised in Subang Jaya and grew up together with my cousins under one roof. I pursued my secondary education in Kolej Yayasan Saad Melaka and hope to further my education in the field of engineering. I am someone who puts my all into my work and will always ensure that whatever I do, I will try my best to be the best.",
              "2. Describe a time when you disagreed with someone during a group discussion/project.",
              "Answer: I once had to work together with my friends to run a food bazaar stall for a charity project. One of the hiccups we faced was when buying our ingredients, the available ingredients were significantly more expensive than what was budgeted and thus, my group and I had to discuss whether to increase prices to make up for the increased cost or to maintain the price but reduce our profit margin. I was of the opinion that we should increase the prices but as group leader, I had to take into account the opinions of my group mates. Particularly, one of my group mates was vocal about maintaining the prices, and I made it a point to understand his rationale. After discussion, we decided to increase prices to meet profit goals."
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "Due dates are critical. Always be aware of submission deadlines and ensure timely submissions.",
              "Get all documents ready and certified (if required). Scan and save them as PDFs for easy reference.",
              "When writing essays, research the company’s vision and mission. Incorporate these into your writing.",
              "Reach out to previous scholars for advice and insights. Different candidates have different experiences, so seek multiple perspectives."
            ]
          },
          {
            "title": "Advice and Tips to Share with Your Juniors",
            "content": [
              "Study diligently and be prepared for all stages.",
              "Check your emails regularly as most communications are done via email. Consider creating a separate email for work-related matters.",
              "Stay flexible and adaptable to changes or unexpected elements in the process.",
              "Approach the interview as a conversation rather than a formal interrogation. Be genuine and confident."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "yuem",
    "name": "Yayasan UEM Education Scholarship",
    "shortName": "Yayasan UEM",
    "description": "The YUEM Scholarship offers SPM leavers the opportunity to undergo pre-university studies at KYUEM, followed by an undergraduate degree at renowned top global universities. Scholars will have access to various Scholars Development Programmes (SDP) and, upon graduation, will work with UEM or their partner companies.",
    "logoPlaceholder": "/assets/company_logos/uem_logo.jpg",
    "scholarshipLevel": "global",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Excellent academic track record in Form 4 and Form 5.",
        "Obtained a minimum of 7As (A+/As) in relevant subjects in the SPM examination."
      ],
      "academicQualifications": [
        "Malaysian citizen who has completed SPM.",
        "Candidates must not be in receipt of any other scholarships or financial aid.",
        "Each applicant can apply for one course only."
      ],
      "additionalCriteria": [
        "Active participation in co-curricular activities.",
        "Demonstrates leadership qualities and a strong commitment to personal development.",
        "Must meet the minimum entry requirements of the chosen course and institution."
      ]
    },
    "requiredDocuments": [
      "SPM results and Form 4/SPM Trial results.",
      "Co-curricular certificates.",
      "Parents or guardians' pay slips.",
      "Certified true copies of Identity Cards (IC) for both parents and candidate.",
      "Birth certificates of parents and candidate.",
      "2 essays for the online application."
    ],
    "coursesOffered": {
      "allowed": [
        "Business (Finance, Business Management, Accounting, Economics)",
        "Engineering (Civil, Mechanical, Electrical)",
        "IT and Computer Related (Computer Science, Computer Systems and Networking, Software Engineering, Data Science, Data Engineering)",
        "Environmental Studies (Science, Technology, Energy)"
      ],
      "notOffered": []
    },
    "countriesOffered": [
      "Malaysia",
      "United States",
      "United Kingdom",
      "Australia"
    ],
    "bondingDetails": {
      "duration": "5 years (Global) & 3 years (Local)",
      "workLocation": "Any government agency or GLC related to Johor government (could be in any state and not necessarily in Johor)."
    },
    "applicationTimeline": {
      "startDate": "Immediately after SPM results announcement",
      "endDate": "Approximately 2 weeks after SPM results announcement",
      "note": "Applicants must be alert and apply for the scholarship on time."
    },
    "numberOfRecipients": {
      "total": 4
    },
    "applicationLink": [
      "https://www.uem.com.my/yayasan-education-scholarship.html"
    ],
    "generalInfoLink": null,
    "resultNotification": [
      "Only shortlisted candidates will be contacted by phone.",
      "If no response is received within 2 months from the closing date, the application is deemed unsuccessful."
    ],
    "applicationProcess": [
      {
        "stage": "Online Application",
        "details": "Fill up the basic information and submit the required documents along with 2 essays (maximum 300 words each).",
        "tips": [
          "Think about your achievements and what makes you stand out before writing your essays.",
          "Be genuine and avoid using AI for essay writing to ensure authenticity."
        ]
      },
      {
        "stage": "Video Submission",
        "details": "Submit a video presentation answering specific questions within a 2-minute limit.",
        "tips": [
          "Ensure all supporting documents are certified by your school principal promptly.",
          "Keep your video presentation clear, concise, and professional."
        ]
      },
      {
        "stage": "Online Group Interview",
        "details": "Participate in a group discussion and individual question-answer session via Microsoft Teams.",
        "tips": [
          "Wear professional attire and maintain a clean background.",
          "Stay calm, think clearly, and communicate effectively without dominating the discussion.",
          "Avoid using AI-generated answers; be authentic in your responses."
        ]
      },
      {
        "stage": "Physical Individual Interview",
        "details": "Attend an in-person interview to discuss your qualifications and suitability for the scholarship.",
        "tips": [
          "Dress professionally and present yourself neatly.",
          "Be humble yet confident in showcasing your strengths and how you can contribute to UEM.",
          "Demonstrate your enthusiasm and commitment to your chosen course."
        ]
      }
    ],
    "contactEmail": "scholarship.info@uemnet.com",
    "contactNumber": null,
    "scholars": [
      {
        "contributorName": "NESAMANI AP VICTOR",
        "contributorImage": "/assets/portrait/nesa_img.jpg",
        "intendedCourse": "Computer Science",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "nesamanivictor",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "1. Introduce yourself.",
              "2. Where do you want to study and why?",
              "3. Why that course?",
              "4. Talk about your family.",
              "5. What do you think you can bring to our company after you graduate?",
              "6. Why do you deserve to be a YUEM Scholar?",
              "7. Talk about your Add Maths journey that you have written in your essay.",
              "8. Talk about your debate/public speaking experiences that you have mentioned as well.",
              "9. Talk about your piano skills.",
              "10. Talk about the innovation competitions you mentioned.",
              "11. Do you like to work alone or in a group? Why?",
              "12. Did you find it difficult to learn coding/Arduino on your own?",
              "13. Talk about your hobbies.",
              "14. What do you watch on YouTube online?"
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "Focus on essay writing as it is the first impression that they will have of you, and that's the only way they evaluate candidates’ potency and eliminate candidates.",
              "During the interview, show enthusiasm for the course you are going to pursue and be steadfast with your choice and decision.",
              "There is no specific thing that they focus on, but try to show your unique self that others don't have."
            ]
          },
          {
            "title": "Advice and Tips to Share with Your Juniors",
            "content": [
              "Online Application Stage:",
              "I made sure I really thought through what I wanted to write. I suggest the same to you, fellow aspiring applicants. Don't immediately start writing the essay, think about it for a day and draft it out. Make sure you are genuine with what you write. Don't use any AI for the essays, it can be detected. You want to stand out, so be authentic. Make yourself stand out!",
              "",
              "Stage 1 Video Submission:",
              "For the supporting documents, make sure you get them certified by your school principal. You need the school stamp and the signature of your principal. PLEASE get it done as soon as you receive this email from YUEM. You don't want to submit at the last minute!",
              "",
              "Stage 2 Online Group Interview:",
              " For this online interview, wear something professional. Although it is not mentioned what you are supposed to wear, remember, you want to stand out.",
              " Since you have to turn on your camera, make sure that your background is clean. (Make sure there are no books messed up behind you or any unfolded, piled-up clothes. Everything matters as it is their first impression of you, so make it a good one.)",
              " When I saw the question that was presented to us, I honestly had no clue about what I should say and what the managers' expectations were. That was partly the reason why I decided to go after hearing other candidates’ answers. No, I did not \"use\" their answers, but I needed a clear picture of what the question was about. After hearing other candidates, I figured it out and gave a pretty good answer :) that I felt was more original and true. When answering the question, don't panic and don't rush. Answer the question calmly and use the time allocated to the max. There is no right or wrong answer for the question that was asked; it is a matter of how you think and how you communicate and convince the managers.",
              " The main manager said that he knew some candidates used ChatGPT/AI to get their answers for the question. He told us that the managers already read the AI-generated answers and have a copy right there with them. So as we spoke, they were practically cross-checking our answers. So aspiring applicants, DO NOT use AI for any interviews. Be authentic.",
              " DO NOT monopolize the whole discussion session. There was a guy in my group who did this, and it was not good for us. He tried to be the \"leader.\" Don't get me wrong, you should be the leader if possible, but always make sure you are not overpowering the discussion. You want to stand out, but don't do it while putting others below you. Work together and give everyone a chance to talk and share their views. Remember, we're all in this together! Help each other out. I remember while this guy in my group monopolized the whole session, I just turned on my mic and asked the passive ones what they think about the case study. And then everyone started talking and sharing their opinions."
            ]
          },
          {
            "title": "Stage 3 Physical Individual Interview",
            "content": [
              "Wear professional clothes and covered shoes. Be neat and tidy. Be calm and composed when you talk to them and brag about yourself in a humble way. You need to convince them (not by bragging toooooo much) that you are the best candidate out there to carry their company name."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "jpa-ppn",
    "name": "Program Penajaan Nasional (PPN) - JPA",
    "shortName": "JPA - PPN",
    "description": "The JPA-Program Penajaan Nasional (PPN) is a highly esteemed scholarship program in Malaysia, structured as a convertible loan. It is designed for outstanding students who excel in the Sijil Pelajaran Malaysia (SPM) examination. Successful recipients of this scholarship are granted the unique opportunity to pursue their undergraduate studies at one of the top 20 universities abroad, as ranked by the Quacquarelli Symonds (QS) World University Rankings for the relevant year. This initiative aims to cultivate future leaders and innovators by providing access to world-class education.",
    "logoPlaceholder": "/assets/company_logos/JPA_logo.png",
    "scholarshipLevel": "global",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Must be a Malaysian citizen.",
        "Applicants must be free from chronic, contagious, or any conditions that require ongoing treatment and must be certified as healthy enough to complete their studies.",
        "The applicant's parents must not be blacklisted by JPA or involved in any legal action with JPA.",
        "Applicants must have taken the SPM examination for the first time at any secondary school or as private candidates.",
        "Must be under the age of 19 (or under 20 for transition students) by 31st December of the SPM exam year.",
        "Not receiving financial aid or sponsorship from any other agency for the same level of study."
      ],
      "academicQualifications": [
        {
          "field": "Engineering/Science and Technology",
          "criteria": [
            "Applicants must achieve at least 9 A+ grades in the following subjects:",
            "Malay Language",
            "English Language",
            "Mathematics",
            "Sejarah",
            "Additional Mathematics",
            "Physics",
            "Chemistry",
            "Islamic Education (or equivalent religious/moral studies)",
            "One additional subject",
            "Additionally, if applicable, they must achieve a minimum of an A- grade in all other subjects."
          ]
        },
        {
          "field": "Non-Engineering/Non-Science and Technology",
          "criteria": [
            "Applicants must achieve at least 8 A+ grades in the following subjects:",
            "Malay Language",
            "English Language",
            "Mathematics",
            "Sejarah",
            "Islamic Education (or equivalent religious/moral studies)",
            "Science",
            "Two elective subjects",
            "Additionally, if applicable, they must achieve a minimum of an A- grade in all other subjects."
          ]
        }
      ]
    },
    "requiredDocuments": [
      "Certified copy of SPM results",
      "Copy of MyKad (identity card)",
      "Copies of both parents' MyKad",
      "Parents' income statement (subject to current requirements)",
      "Health certification or medical report (when prompted)",
      "Recent passport-sized photograph",
      "Any additional supporting documents (e.g., co-curricular certificates) (subject to current requirements)"
    ],
    "coursesOffered": {
      "Engineering/Science and Technology": [
        "Aerospace Engineering",
        "Civil and Structural Engineering",
        "Security Engineering",
        "Biomaterials Engineering"
      ],
      "Science and Technology": [
        "Various scientific and technological fields"
      ],
      "Social Sciences": [
        "Political Science/International Relations",
        "Finance/Banking",
        "Accounting/Taxation",
        "Economics",
        "Psychology"
      ],
      "Creative Industries": [
        "Film and Television Production",
        "Advertising",
        "Graphic Design",
        "Animation and Digital Content Creation",
        "Visual Arts",
        "Creative Writing"
      ]
    },
    "countriesOffered": [
      "United States",
      "United Kingdom",
      "Australia"
    ],
    "bondingDetails": {
      "duration": "Convertible loan (conditions apply)",
      "workLocation": null,
      "repaymentConditions": [
        "Full scholarship (0% repayment) if the student serves in the Public Service after graduation.",
        "25% repayment if the student is employed by a Government-Linked Company (GLC) after graduation.",
        "50% repayment if the student is employed by a private sector company in Malaysia.",
        "100% repayment if the student is employed outside Malaysia."
      ]
    },
    "applicationTimeline": {
      "startDate": "29 May, 2024",
      "endDate": "9 June, 2024",
      "note": "Application opens right after the announcement of SPM results and typically lasts for about 1 week."
    },
    "numberOfRecipients": {
      "local": null,
      "overseas": null,
      "total": 20
    },
    "applicationLink": "https://bmipenajaan.jpa.gov.my/ms",
    "resultNotification": [
      "Applicants can check their application results through a dedicated link provided on the official Jabatan Perkhidmatan Awam (JPA) website.",
      "An email will be sent for successful candidates to attend the Student Assessment Centre (SAC).",
      "Final results will be released approximately 1 month after the SAC session via the portal."
    ],
    "applicationProcess": [
      {
        "stage": "Stage 1: Application Stage",
        "details": "At the first stage, many people will be filtered through their SPM results as this program has the highest entry requirement for the results. Hence, there might be approximately 300 candidates (less than 300) that are eligible to access the application system.",
        "tips": [
          "After completing the application form, candidates need to complete a psychometric test and wait for the e-mail and be prepared for SAC. You do not need to write any essays for your application submission. But you need to compress your passport-size photo as small as possible! (The system can only accept a range of size)",
          "Get prepared for the interview, you can search through online (Youtube etc.) to look for some general questions that might be asked by the interviewer. Please be prepared as soon as possible.",
          "After receiving the email, you will know the date of interview as well as the location."
        ]
      },
      {
        "stage": "Interview Process (Stage 1): Latihan Dalam Kumpulan (LDK)",
        "details": "The group activity is subjected to the current years' arrangements, and is not guaranteed to be the same every year.",
        "tips": [
          "In 2023, the group activity resembles a debate format where participants discuss a given topic. The language of communication is primarily Malay, and candidates are assigned either to support or oppose a statement.",
          "For example, one topic could be, “Advanced technology is harmful to humanity.” Each candidate must present at least two arguments, and the presentation order is randomly determined. Candidates engage in a 10-minute discussion followed by a 15-minute presentation session. Being the last to present can be both advantageous (more preparation time) and disadvantageous (less time to present ideas). During the LDK, assessors actively engage by interrupting to ask questions, fostering a dynamic environment. They maintain a friendly demeanor, aiming to create a comfortable atmosphere for candidates.",
          "In 2024, the LDK was structured differently for different groups, which included group presentations and discussions. This approach aimed to assess candidates' ability to articulate their ideas clearly and collaborate effectively with peers. The process:",
          "1. Registration and short briefing.",
          "2. You will be given a paper bag to keep your phone. Remember to keep your phone in silent mode.",
          "3. You will be given a number and this number determines your group (4-5 members) and your group members.",
          "4. You will enter a room with your group members, sit in a row and face 2 interviewers.",
          "5. The interviewers will ask you questions and all the questions will be answered by every single member in the group. (The order is random)",
          "6. Please answer the questions using the languages requested by the interviewers."
        ]
      },
      {
        "stage": "Interview Process (Stage 2): Follow-Up Interview",
        "details": "After the LDK, candidates proceed to an interview session where they answer questions in both Malay and English, depending on the language used by the assessors.",
        "tips": [
          "Assessors encourage candidates to attempt answers, even if they are unsure, promoting a learning environment.",
          "The JPA interview is an excellent opportunity for candidates to demonstrate their skills and learn about the responsibilities that come with higher education and civic engagement.",
          "Engaging in such processes can be beneficial for personal and professional development, making it highly recommended for SPM graduates."
        ]
      }
    ],
    "contactEmail": "lspln.bmi@jpa.gov.my",
    "scholars": [
      {
        "contributorName": "Teoh Wen Xuen",
        "contributorImage": "/assets/portrait/wen_xuan.jpg",
        "intendedCourse": "Biotechnology (Natural Sciences)",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "xuenxuen_0908",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "The most crucial element during the application process is to become a well-rounded person.",
              "Focus on excelling in academics while actively participating in extracurricular activities.",
              "Highlight leadership roles and achievements that align with the intended course."
            ]
          },
          {
            "title": "Advice and Tips to Share with Your Juniors",
            "content": [
              "Stay calm during the interview.",
              "Research your intended course to show genuine interest and passion.",
              "Get to know your group members and maintain a positive atmosphere.",
              "Be yourself and avoid memorizing answers. Show authenticity.",
              "Lead discussions when appropriate, but allow others to contribute.",
              "Ensure you have sufficient rest and present yourself confidently."
            ]
          }
        ]
      },
      {
        "contributorName": "Verness Chia Xin Thong",
        "contributorImage": "/assets/portrait/Verness.jpeg",
        "intendedCourse": "Data Science",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "vernessc57",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": "/assets/resumes/Verness_Resume.jpg",
        "stories": [
          {
            "title": "Mock-up Interview Questions and Answers",
            "content": [
              "Q: What is your dream course? Can you please further explain?",
              "A: Data Science. The most appealing part of it is the combination of mathematics and AI to process a huge amount of data, subsequently obtaining insights that will be beneficial for various aspects such as businesses. I am looking forward to acquiring knowledge about Machine Learning and coding skills.",
              "Q: What is your dream university?",
              "A: MIT and Stanford offer rigorous courses in data science.",
              "Q: What are some cultural shocks that you experienced?",
              "A: In Korea, I noticed guys putting on makeup, which is rarely seen in Malaysia. This taught me to embrace different perspectives and be open-minded.",
              "Q: What are your contributions to your country?",
              "A: I have participated in competitions and achieved international recognition. Additionally, I contributed to community projects such as recycling initiatives, clean-up campaigns, and visits to orphanages."
            ]
          },
          {
            "title": "Advice and Tips for Juniors",
            "content": [
              "Stay calm and adapt quickly to the interview environment.",
              "Research your intended course and show genuine passion.",
              "Build rapport with your group members before the interview to ease the process.",
              "Be yourself and do not memorize answers; focus on authentic communication.",
              "During discussions, show leadership while allowing others to contribute.",
              "Ensure proper rest and eat well before your interview."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "jpa-lspm",
    "name": "JPA-LSPM (Program Khas Lepasan Sijil Pelajaran Malaysia Dalam Negara)",
    "shortName": "JPA - LSPM",
    "description": "'Program Khas Lepasan Sijil Pelajaran Malaysia Dalam Negara' (LSPM) offers students to pursue their pre-university and undergraduate studies only in Malaysia, unless the student is joining student exchange program that does not require extra fees from JPA. LSPM offers 200 students to pursue pre-university and degree studies in local universities as listed by JPA, including public universities and private universities. Among these three JPA programmes, only LSPM allows students to study medicine, pharmacy and dentistry, hence it gives more choices to students on choosing the degree courses.",
    "logoPlaceholder": "/assets/company_logos/JPA_logo.png",
    "scholarshipLevel": "local",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Malaysian under 19 years old in the year of taking SPM examination",
        "first time sitting for SPM",
        "in good health condition",
        "parents are not blacklisted by JPA or not subjected to legal actions by JPA"
      ],
      "academicQualifications": [
        {
          "field": "Engineering/Science and Technology/Non-Engineering/Non-Science and Technology",
          "criteria": [
            "Applicants must achieve at least 9 A+ grades in any subjects"
          ]
        }
      ]
    },
    "requiredDocuments": [
      "Parents' or Guardian's salary slips and their Tax Identification Numbers (TIN)"
    ],
    "coursesOffered": {
      "(LSPM offers all courses in certain universities except education, flight training, nursing, paramedic science, professional programmes and twinning programmes.)": []
    },
    "countriesOffered": "For the JPA-Program Penajaan Nasional (PPN), only international academic pathways are supported, meaning recipients are sponsored to pursue their undergraduate studies at top global universities, typically among the top 20 institutions in the Quacquarelli Symonds (QS) World University Rankings. In contrast, for those seeking local educational opportunities, the JPA-Lepasan Sijil Pelajaran Malaysia (LSPM) program offers sponsorships for studies within Malaysia, ensuring students have a pathway to higher education domestically. This distinction helps ensure that top-performing students are provided with both local and global opportunities based on their qualifications and preferences.",
    "bondingDetails": {
      "duration": "For LSPM Programme, 1 year of degree studies in public universities indicates 1 year or bonding, while 1 year of degree studies in private universities indicates 1.5 years of bonding.",
      "workLocation": "If the recipient works under civil service for the whole period of bonding, there will be a 100% fee waiver. 25% of loan repayment is required if the recipient works under a government-linked corporation. 50% of loan repayment is required if the recipient works under a private company in Malaysia. If the recipient works overseas, does not have a job or pursues studying for a master, there will be 100% of loan repayment required.",
      "repaymentConditions": [
        "Full scholarship (0% repayment) if the student serves in the Public Service after graduation.",
        "25% repayment if the student is employed by a Government-Linked Company (GLC) after graduation.",
        "50% repayment if the student is employed by a private sector company in Malaysia.",
        "100% repayment if the student is employed outside Malaysia."
      ]
    },
    "applicationTimeline": {
      "startDate": "Immediately after announcement of SPM Results",
      "endDate": "last for less than two weeks",
      "note": "Application opens right after the announcement of SPM results and typically lasts for about 1 week."
    },
    "numberOfRecipients": {
      "PPN": 20,
      "JKPJ": 200,
      "LSPM": 200
    },
    "applicationLink": "https://bmipenajaan.jpa.gov.my/ms/program-penajaan/latihan-sebelum-perkhidmatan/program-untuk-pelajar",
    "resultNotification": [
      "The result will be released on a certain date, you may check the result on the website.",
      "The students can then submit an appeal letter online if the students do not successfully enrol as a recipient."
    ],
    "applicationProcess": [
      {
        "stage": "Stage 1: Application Stage",
        "details": "At the first stage, many people will be filtered through their SPM results as this program has the highest entry requirement for the results. Hence, there might be approximately 300 candidates (less than 300) that are eligible to access the application system.",
        "tips": [
          "After completing the application form, candidates need to complete a psychometric test and wait for the e-mail and be prepared for SAC. You do not need to write any essays for your application submission. But you need to compress your passport-size photo as small as possible! (The system can only accept a range of size)",
          "Get prepared for the interview, you can search through online (Youtube etc.) to look for some general questions that might be asked by the interviewer. Please be prepared as soon as possible.",
          "After receiving the email, you will know the date of interview as well as the location."
        ]
      },
      {
        "stage": "Interview Process (Stage 1): Latihan Dalam Kumpulan (LDK)",
        "details": "The group activity is subjected to the current years' arrangements, and is not guaranteed to be the same every year.",
        "tips": [
          "In 2023, the group activity resembles a debate format where participants discuss a given topic. The language of communication is primarily Malay, and candidates are assigned either to support or oppose a statement.",
          "For example, one topic could be, “Advanced technology is harmful to humanity.” Each candidate must present at least two arguments, and the presentation order is randomly determined. Candidates engage in a 10-minute discussion followed by a 15-minute presentation session. Being the last to present can be both advantageous (more preparation time) and disadvantageous (less time to present ideas). During the LDK, assessors actively engage by interrupting to ask questions, fostering a dynamic environment. They maintain a friendly demeanor, aiming to create a comfortable atmosphere for candidates.",
          "In 2024, the LDK was structured differently for different groups, which included group presentations and discussions. This approach aimed to assess candidates' ability to articulate their ideas clearly and collaborate effectively with peers. The process:",
          "1. Registration and short briefing.",
          "2. You will be given a paper bag to keep your phone. Remember to keep your phone in silent mode.",
          "3. You will be given a number and this number determines your group (4-5 members) and your group members.",
          "4. You will enter a room with your group members, sit in a row and face 2 interviewers.",
          "5. The interviewers will ask you questions and all the questions will be answered by every single member in the group. (The order is random)",
          "6. Please answer the questions using the languages requested by the interviewers."
        ]
      },
      {
        "stage": "Interview Process (Stage 2): Follow-Up Interview",
        "details": "After the LDK, candidates proceed to an interview session where they answer questions in both Malay and English, depending on the language used by the assessors.",
        "tips": [
          "Assessors encourage candidates to attempt answers, even if they are unsure, promoting a learning environment.",
          "The JPA interview is an excellent opportunity for candidates to demonstrate their skills and learn about the responsibilities that come with higher education and civic engagement.",
          "Engaging in such processes can be beneficial for personal and professional development, making it highly recommended for SPM graduates."
        ]
      }
    ],
    "contactEmail": "penawaranlsp@jpa.gov.my",
    "scholars": [
      {
        "contributorName": "Jolin Sung Jie Lin",
        "contributorImage": "/assets/portrait/jolinsung.JPG",
        "intendedCourse": "Pharmacy",
        "currentInstitution": "Sunway College",
        "contactInformation": "sungjolin",
        "currentStudies": "Monash University Foundation Year (MUFY)",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Answers",
            "content": [
              "Q: What is your hobby? ",
              "A: I have been learning dancing ballet for more than 10 years. I actually had thought of becoming a professional dancer in future, so I consistently practise dancing at least thrice in a week. However, the biggest challenge I faced was about the height. Sometimes practice does not make perfect, I am definitely not eligible as a professional dancer, hence I started to study harder to achieve my another dream. ",
              "Q: 2. What is your biggest weakness? ",
              "A: I am easily convinced by others and do not know how to say 'no'. I still remember last month I went to a saloon for a haircut. They told me that if I sign up for a membership, I can enjoy a 25% discount of the total bill when I reload RM 400 into the member card. However, I regretted right after I walked out from the shop, since I realised that I would not go to the store so frequently to spend all the balances in my member account. Luckily, I have learned that I must change my way of thinking and I am trying my best to think before acting. I believe I can not only be someone who is humble to listen to others' opinions but also has rational thinking to analyse the scenario and have my own stand."
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "Confident, respectful, ability to communicate in Malay and English."
            ]
          },
          {
            "title": "Advice and Tips to Share with Your Juniors",
            "content": [
              "i) Ability to speak Malay and English - Can speak both languages fluently as you may be asked to answer the question specifically in English or Malay",
              "ii) Be respectful and humble - Not only show respect to the officers, but also respect every person in the room including your group members. Be open-minded to receive opinions that are different from yours, try to understand and analyse them.",
              "iii) Patriotism - Show love to our country and willingness to serve the society",
              "iv) Know more about yourself - Get to know your personality, your strengths and weaknesses. - Can ask your family and friends for their impressions on you so you can see yourself from different perspectives - Identify the biggest challenge you have and try to solve it",
              "v) Set a goal - Have basic knowledge about the course you want to take in future - Aim for it, fight for it - Always have a plan B"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "bomj",
    "name": "Biasiswa Orang Muda Johor",
    "shortName": "YPJ",
    "description": "Biasiswa Orang Muda Johor is backed by Yayasan Pelajaran Johor. It provides successful applicants with the chance to pursue undergraduate studies in global top-tier universities. Upon graduation, scholars will have the opportunity to embark on a fulfilling career in government agencies or Government-linked companies (GLCs) linked to the Johor government.",
    "logoPlaceholder": "/assets/company_logos/YPJ_logo.png",
    "scholarshipLevel": "global",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Applicant and parents are Malaysia citizens.",
        "Applicant and father OR mother were born or resided in Johor for at least 10 consecutive years (from the date of application).",
        "Being single / unmarried.",
        "Pursuing full-time studies.",
        "Not receiving financial aid / sponsorship from any other agency."
      ],
      "academicQualifications": [
        "Obtain results of at least 9A+ for the following subjects:",
        "Malay.",
        "English.",
        "Mathematics.",
        "History.",
        "Additional Mathematics.",
        "Physics.",
        "Chemistry.",
        "Islamic Education / Moral Education / other equivalent religious studies.",
        "One additional subject.",
        "AND IF ANY:",
        "Obtain a minimum grade of A- for all other subjects."
      ],
      "additionalCriteria": [
        "Strong leadership skills and active participation in extracurricular activities such as societies and clubs, sports, etc."
      ]
    },
    "requiredDocuments": [
      "Copy of Student’s Identification Card.",
      "Copy of Parents’ or Guardian’s Identification Card.",
      "Copy of SPM Result Slip.",
      "Copy of Birth Certificate.",
      "Copy of School Leaving Certificate.",
      "Copy of Death / Divorce Certificate (If Applicable).",
      "Copy of Income Statement of Mother AND Father / Guardian (SALARY SLIP / INCOME STATEMENT / EA FORM).",
      "Certificate of co-curricular activities for the latest 3 years (ALL regardless of level of participation).",
      "Letter of support from the school (if applicable).",
      "Application form (instruction given in the website)."
    ],
    "coursesOffered": {
      "allowed": [
        "Engineering & Technical",
        "Science & Technology",
        "Social Science: Political Science / International Relations, Finance / Banking, Accounting / Taxation, Economics, Psychology"
      ],
      "notOffered": [
        "Medicine",
        "Dentistry",
        "Educational Pharmacy",
        "Nursing",
        "Courses requiring licences such as aviation licences and professional courses such as ACCA and CLP"
      ]
    },
    "countriesOffered": [
      "The world's 20 best universities as listed in the Times Higher Education (THE) World University Rankings, Quacquarelli Symonds (QS) World University Rankings, and / or Academic Ranking of World Universities (ARWU) based on university ranking."
    ],
    "bondingDetails": {
      "duration": "5 years",
      "workLocation": "Any government agency or GLC related to Johor government (could be in any state and not necessarily in Johor)."
    },
    "applicationTimeline": {
      "startDate": "May 26, 2024",
      "endDate": "June 8, 2024",
      "note": "SPM result released: 27 May 2024. All documents and certificates must be submitted to Yayasan Pelajaran Johor office in Larkin, Johor Bahru before deadline."
    },
    "numberOfRecipients": {
      "2023": 3,
      "2024": 6
    },
    "applicationLink": "https://prolims.gov.my/",
    "generalInfoLink": "https://portal.ypj.gov.my/biasiswa-orang-muda-johor/",
    "resultNotification": [
      "Applicants will be notified via SMS to attend the assessment session.",
      "Recipients will be notified through phone call."
    ],
    "applicationProcess": [
      {
        "stage": "Successful Applicants Invitation",
        "details": "Successful applicants will be invited to attend a 3-day assessment. Unlike other scholarship bodies, there is no need to write an essay or create a video 🥳.",
        "tips": [
          "Prepare yourself for a range of activities that test leadership, teamwork, communication, and critical thinking.",
          "Get plenty of rest before the assessment to stay sharp and focused during the 3 days."
        ]
      },
      {
        "stage": "Day 1-3 Activities",
        "details": "The activities across the 3 days include: \n\n- **Draw on a Paper**: Introduce yourself (your character, goals, setbacks) creatively through drawing. \n\n- **Games and Activities**: Designed to test your leadership, teamwork, and communication skills. Participate actively to demonstrate these qualities. \n\n- **English Test**: Comprising grammar, vocabulary, comprehension reading, and opinionated writing. The writing test is similar to IELTS Writing Task 2. \n\n- **IQ Test**: Includes maths and sentence-based IQ questions. The maths section is straightforward and doesn’t require advanced calculations. \n\n- **Interactive Sessions**: Learn about setting realistic goals and developing effective action plans. Engage in reflections and voice out your opinions during discussions. \n\n- **Debate**: Groups of 3-4 people debate on national issues for 3 minutes per group. The format is informal, so prior experience isn’t necessary. Key topics include digital education, public transportation, and whether the government should spend more money on natural disaster prevention measures.",
        "tips": [
          "Be creative and authentic when introducing yourself through the drawing activity.",
          "Actively participate in games and group discussions to showcase teamwork and leadership skills.",
          "Study English grammar, vocabulary, and practice opinionated writing similar to IELTS Writing Task 2.",
          "Brush up on basic math and sentence-based logic for the IQ test.",
          "Research national issues beforehand by reading newspapers or articles from Khazanah Research Institute (https://www.krinstitute.org/).",
          "During debates, focus on articulating your opinions clearly, even if you lack prior experience."
        ]
      },
      {
        "stage": "Final Interview",
        "details": "10 applicants will be selected to attend a 30-minute interview session on the following day. The interview will be conducted in both English and Malay.",
        "tips": [
          "Prepare to discuss your experiences, strengths, and goals confidently in both languages.",
          "Practice answering potential questions in Malay and English to ensure fluency.",
          "Stay composed and genuine during the interview to leave a strong impression."
        ]
      }
    ],
    "contactEmail": "biasiswapelajaran@ypj.gov.my",
    "contactNumber": "07-2344355",
    "scholars": [
      {
        "contributorName": "Tan Wen Bin",
        "contributorImage": "/assets/portrait/Wen_Bin.jpeg",
        "intendedCourse": "Computer Science",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "tanwenbin0709",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "https://efficient-parent-8ec.notion.site/BOMJ-5ed7432570c842e4bee1eed2f1886a11?pvs=4"
            ]
          },
          {
            "title": "Advice and Tips to Share with Your Juniors",
            "content": [
              "Don’t be afraid to voice out your opinions but do ensure they are RELEVANT.",
              "Strong leadership skills and active participation in the sessions.",
              "Be honest and genuine. Don’t try to lie as you’ll definitely struggle during follow-up questions.",
              "Have a good understanding of yourself. (Strength, weakness, course, goals, reasons for your choice, etc.)",
              "Do ample preparation about your course and how it aligns with Johor’s developments.",
              "Know facts about Malaysia and Johor (Menteri Besar, districts, population, recent development such as RTS link, Johor-Singapore Special Economic Zone etc.)",
              "Read about IR 4.0, Society 5.0, Khazanah Research Institute.",
              "Don’t give vague responses. Support your ideas with statistics."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "kijang-bnm",
    "name": "Bank Negara Malaysia Kijang Scholarship",
    "shortName": "Bank Negara",
    "description": "The Kijang Scholarship is awarded to eligible individuals to pursue pre-university programmes at BNM's approved pre-university colleges. This scholarship provides tuition fees, subsistence allowance, as well as related scholarship allowances. The subsequent sponsorship to pursue an undergraduate programme is subject to the candidate meeting the Bank’s requirements.",
    "logoPlaceholder": "/assets/company_logos/bank_negara.png",
    "scholarshipLevel": "global",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Excellent examination result: A minimum of 8As (A and A+ only) obtained for SPM examinations",
        "Strong leadership qualities, proven teamwork capabilities, outstanding performance in extra-curricular activities",
        "Exceptional interpersonal skills",
        "Not exceeding 19 years of age"
      ]
    },
    "requiredDocuments": [
      "Passport Size Photo",
      "SPM Result",
      "Certificates",
      "Parents' or Guardians' salary slips or EA form"
    ],
    "coursesOffered": [
      "Economics",
      "Accounting",
      "Finance",
      "Actuarial Science",
      "Mathematics",
      "Statistics",
      "Law",
      "Data Science",
      "Computer Science"
    ],
    "countriesOffered": [
      "Both Local and Global"
    ],
    "bondingDetails": {
      "duration": "Scholars will be required to serve their employment bond with BNM (i.e. ratio of one year of study to two years of service).",
      "workLocation": "Bank Negara Malaysia headquarters or other relevant locations"
    },
    "applicationTimeline": {
      "startDate": "May 24, 2024",
      "endDate": "June 9, 2024"
    },
    "numberOfRecipients": {
      "2024": 30
    },
    "applicationLink": "https://www.bnm.gov.my/careers/scholarships",
    "resultNotification": [
      "Via email",
      "To confirm your acceptance, you must reply to the email by filling in the provided forms."
    ],
    "applicationProcess": [
      {
        "stage": "Stage 1: Cognitive Ability Test (CAT)",
        "details": "This is essentially an English and Mathematics test. There is also an extra rubric where you are required to determine patterns of given photos. There is a limited amount of time, so candidates are expected to have a high level of comprehension in a short amount of time.",
        "tips": [
          "Practice solving pattern-based problems to improve your visual reasoning skills.",
          "Enhance your English comprehension and mathematical problem-solving under timed conditions.",
          "Stay calm and focus on accuracy while managing your time effectively."
        ]
      },
      {
        "stage": "Stage 2: Video Submission + Psychometric Assessment (Factors+)",
        "details": "Candidates who are eligible will be notified early on. In this stage, there will be a video submission. For my cohort, we were required to talk about a book or movie (Describe it, why is it significant) for not more than 2 minutes. We were also required to answer some psychometric questions that display our personality overall.",
        "tips": [
          "Choose a book or movie that you are genuinely passionate about and can explain with clarity.",
          "Practice speaking clearly and concisely to fit within the 2-minute limit.",
          "Be authentic and honest in the psychometric test to reflect your true personality."
        ]
      },
      {
        "stage": "Final Stage: 2-Day, 1-Night Stay in Lanai Kijang",
        "details": "Candidates who are eligible will be notified early on. In this stage, candidates are required to stay in Lanai Kijang, a resort owned by Bank Negara Malaysia in Kuala Lumpur. Those who are unable will be participating in an online interview. Groups will be divided in Lanai Kijang, and you will get to have an ice-breaking session. The real game is day 2, because that's when the assessments come. There will be 3 panels assigned to each group, and they will observe you as you and your groupmates work together. There were two assessments, the first was an activity where we presented our intended courses in a creative way. The second one was a case study. For my group we had to discuss the application of AI in Tvet sectors(something like that). After lunch, there will be an individual interview, this is the finale. You will be alone with 3 panels in a room. It will take up to 30 minutes, and that is where questions of personality and ability will be given.",
        "tips": [
          "Engage actively in group activities and showcase your teamwork and leadership skills.",
          "Be creative and thorough when presenting your intended courses.",
          "Research topics like AI in various sectors to prepare for potential case studies.",
          "Stay composed and confident during the individual interview and answer questions thoughtfully."
        ]
      }
    ],
    "contactEmail": "profiling@bnm.gov.my",
    "scholars": [
      {
        "contributorName": "Trinity Seow Kit Ye",
        "contributorImage": "/assets/portrait/Trinity.jpeg",
        "intendedCourse": "Economics",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "anc.hovies",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "Why do you want to pursue economics?",
              "Why did you choose Bank Negara?",
              "What did you do to prepare for this interview?",
              "What real world issues did you learn from your research?",
              "What was a challenging situation you faced?",
              "Why did you choose to study in the US/UK?",
              "What would you do if you didn't get accepted, and what if you did?"
            ]
          },
          {
            "title": "Advice and Tips to Share with Your Juniors",
            "content": [
              "i) Stay True to Yourself:",
              "Be confident in yourself and your abilities.",
              "Let your personality shine through, and be honest about your current knowledge.",
              "Don't pretend to know more information than you actually do. They WILL ask you further questions on what you tell them.",
              "ii) Leadership and Teamwork:",
              "Take the opportunity to showcase your leadership skills during group assessments.",
              "Listen to your groupmates' ideas, and develop good strategies in solving the problem at hand.",
              "You don't necessarily HAVE to be the leader, as fighting for that position within the group may result in misunderstandings. Nonetheless, make sure you provide contributions during discussions and take initiative when the opportunity arises. Display your abilities to the assessors watching!",
              "iii) Be Open Minded:",
              "After every group assessment, you are given time to reflect on your errors and discuss what improvements could've been made.",
              "In the final interview, the assessors will point out flaws in your approach during the assessments. Be receptive towards their input, and consider looking at things from different perspectives.",
              "iv) Nation Building Mindset:",
              "As Bank Negara is the central bank of Malaysia, it's important to understand your role in contributing to the country if you were to work at the bank.",
              "v) Show Interest in Your Chosen Course:",
              "This doesn't mean you need to have a deep understanding of it. However, it is important to be knowledgeable on some information regarding your course.",
              "For economics, I read a few books regarding the topic, which showed that I had passion in pursuing the course. Since I did research, I was able to answer questions involving economics given by my assessors to a certain degree."
            ]
          }
        ]
      },
      {
        "contributorName": "Liaw Chong Ye",
        "contributorImage": "/assets/portrait/liawchongye.jpg",
        "intendedCourse": "Economics",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "layawcina",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "Q: Please introduce yourself.",
              "A: Hi, my name is Liaw Chong Ye. I am 18 years old and I am intending to pursue economics under the Kijang Scholarship. A few fun facts about me, I was the only Chinese in my secondary school throughout 5 years. This experience allowed me to accept diverse communities and cultures better. I also really like mathematics because I find it fascinating how formulas and equations are formed, as well as enjoying the feeling of getting complex questions right.",
              "Q: On the scale of 1-10, how would you rate yourself throughout the assessments today?",
              "A: I will give myself an 8/10. Because I feel like I have a bit of lacking in some aspects when discussing the case study with my teammates. I am glad they can fill up the gaps that I lacked. I personally went for a more moderation approach by keeping track on time and ensuring the discussions were not side tracking.",
              "Q: How much do you know about Bank Negara Malaysia?",
              "A: I know BNM is the place to promote financial and monetary stability in the country. I also know BNM acts as an advisor to the government when it comes to releasing our yearly budget. I also know a bit about how BNM is important in determining the interest rate for the banks in our country."
            ]
          },
          {
            "title": "Advice and Tips to Share with Your Juniors",
            "content": [
              "Be yourself (obviously).",
              "Don't act smart if you are not smart, that's crucial. This is really important because bear in mind that the panels are way more knowledgeable than you.",
              "Have good teamwork, not necessarily being the leader, being the moderator can also be sufficient enough.",
              "If you want the scholarship, show that you want the scholarship, practice interviews, sharpen your essay, in other words make it seem like you are desperate.",
              "Read up a bit on Bank Negara, but don't abuse terminologies during the interview unless you are really knowledgeable about it.",
              "Be confident with your capabilities, just trust yourself.",
              "Enjoy the process, make more connections and friends."
            ]
          }
        ]
      },
      {
        "contributorName": "Joachim Low Cher Yang",
        "contributorImage": "/assets/portrait/Joachim.jpg",
        "intendedCourse": "Accounting and Finance",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "joaloww",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "Q: Please introduce yourself.",
              "Ans: My name is Joachim Low Cher Yang. I applied to pursue Accounting and Finance under the Bank Negara Kijang Scholarship. I am from Malaysia.",
              "Q: What do you know about Bank Negara?",
              "Ans: BNM is a financial institution that plays an important role in our country's development. It helps regulate policies and provides advisory on economic decisions for the government.",
              "Q: What is the importance of international reserves?",
              "Ans: International reserves are assets our country holds that contain value, such as gold and foreign currency. These reserves function as a backup fund to sustain our economy during emergencies. International reserves are like a personal bank account—having more ensures financial stability and the ability to handle unforeseen circumstances.",
              "Q: We have all experienced stress in life. When do you feel the most stressful moment in your life?",
              "Ans: Well, I won't say there is a single point that was the most stressful, but my entire life has been under a certain amount of pressure due to unforeseen circumstances.",
              "Q: From yesterday's group activity, state 2 strengths and 2 weaknesses that you realized and how you are going to find a solution for them.",
              "Ans: One weakness I realized is that during the start of the group activity, no one took charge of the group, and we all executed our ideas individually. This highlighted the lack of leadership. I would try to be more involved and bring my team into discussions to lead them in the right direction. Another weakness was the lack of communication. Group members were doing their own tasks without coordination. To improve, I would encourage open communication to ensure everyone is on the same page.",
              "For strengths, one is that I managed to bring my group together after guidance from our mentors. I initiated a discussion to align our goals, assigned tasks, and ensured we could consult each other to overcome challenges efficiently. This led to better synchronization and a decent presentation. Another strength is that I consider my groupmates' ideas, break them down into pros and cons, and discuss them collectively to reach a conclusion. This ensures everyone's participation without being overly dominant."
            ]
          },
          {
            "title": "Advice and Tips to Share with Your Juniors",
            "content": [
              "1. Understand what your scholarship body does.",
              "Eg. Research what BNM actually does and have a general idea about it.",
              "2. Have a character and understand what you want to do for your future.",
              "This allows you to know more about yourself and apply your passions to the scholarship application. By doing so, you can stand out as an applicant.",
              "You may also add what lessons you learned from your previous mistakes in life. Don't be afraid to share them, as they demonstrate personal growth and maturity.",
              "3. Be brave to share your thoughts to allow the interviewers to better understand you.",
              "Ensure your thoughts are mature enough to be expressed. Avoid sharing immature thoughts, such as those related to violence, bias, or selfishness."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "sarawak-energy",
    "name": "Sarawak Energy Scholarship Programme (Global)",
    "shortName": "Sarawak Energy: Global",
    "description": "The Sarawak Energy Scholarship Programme provides outstanding Sarawakians great opportunities to pursue Pre-U and Undergraduate studies in both local and global universities, diploma in UNITEN, and also a Post-graduate programme. Scholars are also given the opportunity to intern under SEB for 10 weeks during their 3rd year of degree, exposing them to the corporate world prior to graduation. After graduation, scholars will be bonded based on programme specification under SEB, one of the best employers in Sarawak. Restricting to only Sarawakians, Sarawak Energy aims to attract top Sarawakian talents to help realise their vision of achieving sustainable growth and prosperity for Sarawak and its people by meeting the region’s need for reliable and renewable energy.",
    "logoPlaceholder": "/assets/company_logos/Sarawak_Energy_logo.jpg",
    "scholarshipLevel": "global",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Not a recipient of any other scholarship or financial aid.",
        "Strong leadership qualities, excellent team player, excels in both extra-curricular activities and sports.",
        "No family member is currently a Sarawak Energy Scholarship recipient."
      ],
      "academicQualifications": [
        {
          "field": "Pre-U (Foundation or A-Levels)",
          "criteria": [
            "21 years old or below at the time of application",
            "Minimum 8As in Sijil Pelajaran Malaysia (SPM) (Trial SPM results accepted for students taking SPM in 2024)"
          ]
        },
        {
          "field": "Undergraduate Programme",
          "criteria": [
            "24 years old or below at the time of application",
            "Minimum 8As in SPM or 3.30 CGPA in Sijil Tinggi Persekolahan Malaysia (STPM)/Matriculation/Foundation/Diploma"
          ]
        }
      ],
      "additionalCriteria": [
        "Participate in diverse types of extracurricular activities"
      ]
    },
    "requiredDocuments": [
      "SPM (actual / trials) / STPM / Foundation / A-levels Result",
      "Co-curricular activities and Competition Certificates",
      "Preferred College Tuition Fee Structure",
      "Copy of own IC and Parent's/Guardian's IC",
      "Copy of Parents' or Guardians' salary slips or EA form"
    ],
    "coursesOffered": {
      "allowed": [
        "Technology & Digital",
        "Computer Science",
        "Creative Multimedia",
        "Management",
        "Engineering"
      ],
      "notOffered": [
        "Medicine",
        "Dentistry",
        "Educational Pharmacy",
        "Nursing",
        "Courses requiring licences such as aviation licences and professional courses such as ACCA and CLP"
      ]
    },
    "countriesOffered": [
      "Both. Usually the United States or United Kingdom but YTM also sends their students to France, Germany, Korea, Japan, or Australia."
    ],
    "bondingDetails": {
      "duration": "Serve for 5 years for local students and 7 years for overseas students if hired by TM Group",
      "workLocation": "Work under SEB (mainly in Sarawak)"
    },
    "applicationTimeline": {
      "startDate": "May 27, 2024",
      "endDate": "June 6, 2024",
      "note": "This is one of the earliest Scholarships that you can apply to after you finish your SPM, as it accepts your Trials result as well. It opens way before SPM result, roughly 1 month after SPM ends."
    },
    "numberOfRecipients": {
      "total": 205,
      "global": 5,
      "local": 200
    },
    "applicationLink": "https://www.sarawakenergy.com/careers/scholarship/sarawak-energy-scholarship-programme",
    "generalInfoLink": null,
    "resultNotification": [
      "Shortlisted applicants will receive an invitation email to the interview. Both physical and online interviews are available.",
      "After the interview, candidates will receive another email notifying the interview outcomes, whether it's rejection or acceptance.",
      "If you receive a phone call from an officer asking for confirmation in your choice of university, especially if confirming that you're applying overseas, you're in their pool of overseas candidates."
    ],
    "applicationProcess": [
      {
        "stage": "Interview Session 1: Case Study",
        "details": "You'll be grouped together randomly with other candidates (Pre-U & Undergrads are interviewed at the same time, so don't be surprised if you have degree students as your groupmate), and a case will be given. You'll be given 20 minutes to study the case, then come up with a Stakeholder Engagement Plan with your team in the form of a Presentation. Be a team player, analyse the situation critically and facilitate discussions among your teammates. Refrain from cutting off your teammate, and also yapping. Keep the discussions concise and constructive as time is a huge factor as well. Also, do utilise all the tools given especially maps.",
        "tips": [
          "Be a team player and facilitate constructive discussions.",
          "Utilise all the tools provided, especially maps.",
          "Keep your discussions concise and focused on the task."
        ]
      },
      {
        "stage": "Interview Session 2: Individual Interview",
        "details": "You'll be interviewed by 2 officers. Be prepared to answer any personal and technical questions. Remember to be honest as they can tell if you're lying, it will not look good! Research properly any information regarding the company or your related course to boost your idea and confidence.",
        "tips": [
          "Be honest and genuine in your responses.",
          "Research the company and your related course thoroughly.",
          "Stay confident and composed during the interview."
        ]
      }
    ],
    "contactEmail": "scholarship@sarawakenergy.com",
    "contactNumber": null,
    "scholars": [
      {
        "contributorName": "Kendrick Lim Ken Lik",
        "contributorImage": "/assets/portrait/kendrick_white.jpg",
        "intendedCourse": "Electrical & Electronics Engineering",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "kendrickllim",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "Q: Introduce yourself",
              "List down roughly 3 main points you want them to know about yourself.",
              "My 3 points: Why am I interested in EE, My high school KK achievements, Why do I wanna pursue overseas studies under SEB.",
              "#Your Key Selling Point",
              "",
              "Generally if your response was interesting to them, they'll prompt you a few follow-up questions.",
              "I got asked:",
              "Q: What is your take on mental health? (Cuz I talked about how I balance between studies and KK while making sure I still get to play around to keep a healthy mental state)",
              "Q: If you were the new Minister of Health, what would you do differently from the current Minister of Health? (Cuz I talked about my experiences as a First Aider under St John Ambulance)",
              "#Gauging your honesty and ability to handle sudden situations",
              "",
              "Q: Describe a time when you solved a conflict",
              "A: Be genuine and honest here, they can tell if you're making things up",
              "#Gauging your maturity and teamwork skills",
              "",
              "Q: Imagine you're leading a team under SEB to build a generator in a rural area, you and your team are confronted by a local tribe keeping your team's advancements, what would you do and why?",
              "A: Try to actually imagine yourself in that situation. Remember, communication is always the key, so revolve your answer around effective communication between 2 parties",
              "#Gauging your leadership skills and critical thinking skills",
              "",
              "Q. If an elephant suddenly appears in your backyard, what would you do?",
              "A: There's no right or wrong answer to this question. Be as realistic as possible in your answers",
              "#Gauging your ability to stay rational under sudden situations",
              "",
              "Q: On a scale of 1 to 10, 1 being the lowest, 10 being the highest, how much would you rate yourself and why?",
              "Try to be humble but do not undermine yourself. They are looking for an honest and reflective individual who's not afraid of being transparent with others about their own shortcomings, and at the same time conscious about their own strengths."
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "Your own understanding of the company itself. Understand that the scholarship provider is sponsoring you a few millions for your study, not theirs, and you must prove to them that you're one of if not the best candidates out there. Research anything about the company which sparks your interest, and try to link your personal goal with the company's goal or vision. This'll show to them that you're in fact very serious and committed to not only the scholarship application but generally towards the company itself, trust me they'll mark a big green tick on you!"
            ]
          },
          {
            "title": "Advice and Tips to share to your juniors",
            "content": [
              "Plan ahead and apply as early as possible",
              " Please do not procrastinate, try to complete as much application as possible at one time to prevent any piled up work",
              "Scholarship is not everything!",
              " It is only meant as an aid to your education, not your education itself. It is not the end of the world if you didn't land the scholarship, there's a lot of factors playing into the decisions so do not be too disappointed. You can try again maybe next year!"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "sesp-local",
    "name": "Sarawak Energy Scholarship Programme (Local)",
    "shortName": "Sarawak Energy: Local",
    "description": "The Sarawak Energy Scholarship Programme aims to attract top Sarawakian talents to help them realize their vision of achieving sustainable growth and prosperity for Sarawak and its people by meeting the region’s need for reliable and renewable energy. Aligned with this, the Sarawak Energy Programme is actively looking to invest in and develop Sarawak’s brightest young talents, allowing them to pursue their studies at local and international universities. If you are a Sarawakian student who excels academically and demonstrates leadership in extracurricular activities, you are invited to apply for Sarawak Energy’s Scholarship programme.",
    "logoPlaceholder": "/assets/company_logos/Sarawak_Energy_logo.jpg",
    "scholarshipLevel": "local",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Not a recipient of any other scholarship or financial aid.",
        "Strong leadership qualities, excellent team player, excels in both extra-curricular activities and sports.",
        "No family member is currently a Sarawak Energy Scholarship recipient."
      ],
      "academicQualifications": [
        "Obtained a minimum 8A's in Sijil Pelajaran Malaysia (SPM) *(Trial SPM results accepted for students taking SPM in 2024)*",
        "21 years old or below at the time of application"
      ],
      "additionalCriteria": []
    },
    "requiredDocuments": [
      "SPM Result (Trial SPM results accepted for students taking SPM in 2024)",
      "Certificates of Co-Curricular Activities",
      "IC Copy of students and parents",
      "Parents' or Guardians' salary slips or EA form",
      "Offer letter from the university that you prefer to study at"
    ],
    "coursesOffered": {
      "allowed": [
        "Electrical Engineering",
        "Civil Engineering",
        "Mechanical Engineering",
        "ICT (Software Engineering / Computer Science / Information Systems)",
        "Accounting / Finance / Commerce"
      ],
      "notOffered": [
        "Medicine",
        "Dentistry",
        "Pharmaceutical",
        "Clinical Psychology",
        "Food Technology",
        "Fine Arts",
        "Aeronautics",
        "Other related studies"
      ]
    },
    "countriesOffered": [
      "Local public university and private university (e.g., University Malaya, Sunway University)"
    ],
    "bondingDetails": {
      "duration": "The Scholar shall be bonded for employment with Sarawak Energy. Bonding time depends but the minimum requirement period is at least 3 years if you successfully graduate with your bachelor's degree.",
      "workLocation": "Sarawak Energy"
    },
    "applicationTimeline": {
      "startDate": "1 May 2024",
      "endDate": "30 May 2024",
      "note": "Based on the official website of the Sarawak Energy Scholarship Programme, applications for the year 2024 are open from 1 to 30 May 2024. Ensure you regularly visit the official website to stay informed and avoid outdated information."
    },
    "numberOfRecipients": {
      "previousYear": 127,
      "annually": 127
    },
    "applicationLink": "https://www.sarawakenergy.com/careers/scholarship/sarawak-energy-scholarship-programme",
    "generalInfoLink": null,
    "resultNotification": [
      "Via Email"
    ],
    "applicationProcess": [
      {
        "stage": "Stage 1: Screening Stage",
        "details": "Completing the Application Form and selecting the courses you wish to study. Prepare and upload your relevant and impressive certificates as part of your application. If shortlisted, bring original certificates to the interview.",
        "tips": []
      },
      {
        "stage": "Interview Session 1: Case Study",
        "details": "You'll be grouped together randomly with other candidates (Pre-U & Undergrads are interviewed at the same time, so don't be surprised if you have degree students as your groupmate), and a case will be given. You'll be given 20 minutes to study the case, then come up with a Stakeholder Engagement Plan with your team in the form of a Presentation. Be a team player, analyse the situation critically and facilitate discussions among your teammates. Refrain from cutting off your teammate, and also yapping. Keep the discussions concise and constructive as time is a huge factor as well. Also, do utilise all the tools given especially maps.",
        "tips": [
          "Be a team player and facilitate constructive discussions.",
          "Utilise all the tools provided, especially maps.",
          "Keep your discussions concise and focused on the task."
        ]
      },
      {
        "stage": "Interview Session 2: Individual Interview",
        "details": "You'll be interviewed by 2 officers. Be prepared to answer any personal and technical questions. Remember to be honest as they can tell if you're lying, it will not look good! Research properly any information regarding the company or your related course to boost your idea and confidence.",
        "tips": [
          "Be honest and genuine in your responses.",
          "Research the company and your related course thoroughly.",
          "Stay confident and composed during the interview."
        ]
      }
    ],
    "contactEmail": "scholarship@sarawakenergy.com",
    "contactNumber": null,
    "scholars": [
      {
        "contributorName": "Jason Hii Lian Cheng",
        "contributorImage": "/assets/portrait/jason_img.jpg",
        "intendedCourse": "Electrical and Electronics Engineering",
        "currentInstitution": "Curtin University Malaysia",
        "contactInformation": "jasonhii0825",
        "currentStudies": "Foundation in Engineering and Science",
        "motivationalQuote": null,
        "resumeImages": [
          "/assets/resume/jason_hii_resume.jpg"
        ],
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "Self-Introduction",
              "Reasons for you to apply for this scholarship",
              "Why do you deserve this scholarship?",
              "Why do you choose this field of study?",
              "How have you demonstrated leadership",
              "Describe a challenge you have faced and how you overcame it.",
              "* Tips: Choose a significant challenge and focus on the actions you took to overcome it and the lessons you learned. Highlight your resilience, problem-solving skills, and determination.",
              "What will you do if you don’t receive this scholarship?",
              "* Tips: Show your determination by discussing your backup plans. Mention other scholarships you are applying for, your willingness to work part-time, or any other strategies you have to fund your education."
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "Please bear in mind that practice makes perfect! Try to prepare a set of mock-up interview questions and practice answering them. Focus on articulating your thoughts clearly and confidently. Additionally, do some research about the Sarawak Energy Company! Familiarize yourself with Sarawak Energy Company. Look into their mission, vision, and core values, as well as their latest projects and achievements. Understanding their current challenges and opportunities will give you valuable insight into their operations and priorities. Do talk more about how you can bring impact to the community! Think critically about how you can contribute meaningfully to the organization and the community. Be ready to discuss your unique strengths, and ideas, and how they could address specific challenges or further the company's objectives."
            ]
          },
          {
            "title": "Advice and Tips to share to your juniors",
            "content": [
              "I'll talk more about tips in the group discussion.",
              "During the group discussion, make the most of the 20-minute time limit to collaborate effectively and showcase your leadership skills. Once the time starts, take the initiative to break the ice and set the tone for the discussion. Introduce yourself briefly and encourage others to do the same to create a comfortable and cooperative atmosphere. Then, step into the role of the team leader confidently. Begin by sharing your perspective on the case study, clearly outlining your initial thoughts, observations, or ideas. This will help in setting a foundation for the discussion and inspire others to contribute.",
              "Encourage every team member to share their viewpoints. For instance, you can say, \"What are your thoughts on this?\" or \"Does anyone have a different perspective?\"",
              "Actively listening and showing appreciation for each member’s input fosters collaboration and inclusivity.",
              "Remember to manage your time effectively. Always keep an eye on the clock and allocate time for brainstorming, refining ideas, and preparing your presentation.",
              "For example:",
              "5 minutes: Discuss and brainstorm ideas.",
              "10 minutes: Build consensus and structure the presentation.",
              "5 minutes: Rehearse and finalize roles for the presentation.",
              "*Work with the group to identify key points and structure the presentation logically.*",
              "*Assign roles based on individual strengths, ensuring everyone has a part to play in the final presentation.*",
              "Reminder: Your results don’t define your entire journey. They don’t define your potential or your future. Stay focused on the opportunity ahead and approach the interview with confidence. Success is about growth, resilience, and staying true to yourself! :)"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "bcns",
    "name": "Biasiswa Cemerlang Negeri Sabah",
    "shortName": "Yayasan Sabah",
    "description": "The Biasiswa Cemerlang Negeri Sabah is a scholarship that is awarded to top-scoring SPM students who reside in Sabah by Yayasan Sabah. This scholarship provides an opportunity for the scholars to pursue their undergraduate studies, whether locally or abroad. Upon graduation, the scholars are encouraged to come back to Sabah to serve the state and forge a brighter future for the people of Sabah.",
    "logoPlaceholder": "/assets/company_logos/Yayasan_Sabah_logo.png",
    "scholarshipLevel": "global",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Strong academic background",
        "Excellent records of Co-Curriculum activities"
      ],
      "academicQualifications": [
        "Obtained straight A's with a minimum of 5A+ in the recent SPM examination",
        "Obtained A+ in Bahasa Melayu",
        "Not exceeding 19 years of age",
        "Citizen of Sabah"
      ],
      "additionalCriteria": []
    },
    "requiredDocuments": [
      "Salinan Kad Pengenalan",
      "Salinan Surat Beranak",
      "Salinan Surat Beranak Bapa",
      "Salinan Kad Pengenalan Bapa",
      "Salinan Surat Beranak Ibu",
      "Salinan Kad Pengenalan Ibu",
      "Surat Tawaran Universiti",
      "2 Keping Salinan Gambar Passport",
      "Salinan Sijil SPM",
      "Salinan slip gaji/surat tidak bekerja Ibu bapa"
    ],
    "coursesOffered": {
      "allowed": [
        "Open / Student's choice"
      ],
      "notOffered": []
    },
    "countriesOffered": [
      "Both Local and Global (examples: United Kingdom, Singapore, Australia, Canada, United States)"
    ],
    "bondingDetails": {
      "duration": "No bonding",
      "workLocation": "After graduation, the recipient is expected to apply for their job independently."
    },
    "applicationTimeline": {
      "startDate": "Right after announcement of SPM Results",
      "endDate": "31st of July",
      "note": "This is one of the earliest Scholarships that you can apply to after you finish your SPM, as it accepts your Trials result as well. It opens way before SPM result, roughly 1 month after SPM ends."
    },
    "numberOfRecipients": {
      "total": 40
    },
    "applicationLink": "https://ptps.sabah.gov.my/",
    "generalInfoLink": null,
    "resultNotification": [
      "Via Phone Call"
    ],
    "applicationProcess": [
      {
        "stage": "Stage 1: Application Process",
        "details": "Normally, students would apply for Biasiswa Cemerlang Negeri Sabah (BCNS) through the Yayasan Sabah website. Though for my case, I was called ahead of time by an officer of Yayasan Sabah to let me know that I was selected for a candidacy evaluation for the said scholarship.",
        "tips": []
      },
      {
        "stage": "Stage 2: Emailing Documents Required",
        "details": "Email the documents aforementioned to the scholarship body's email. Simple and straightforward.",
        "tips": []
      },
      {
        "stage": "Stage 3: Results",
        "details": "Yayasan Sabah will take a few weeks to process all the documents sent from you and other students. Once processed, they would call you via phone call to let you know that you have secured the scholarship. An invitation would also be sent out to you via message for the awards ceremony program held in Sabah.",
        "tips": []
      }
    ],
    "contactEmail": "biasisways@ysnet.org.my",
    "contactNumber": null,
    "scholars": [
      {
        "contributorName": "Dominic Benjamin",
        "contributorImage": "/assets/portrait/Dominic.webp",
        "intendedCourse": "Chemical Engineering",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "dmncbjm",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "There are no interviews required for this scholarship."
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "I believe that possessing a strong academic background and good extracurricular activities would make you stand out more than other applicants."
            ]
          },
          {
            "title": "Advice and Tips to share to your juniors",
            "content": [
              "1. Step Out of Your Comfort Zone",
              "If you're an introvert like me, the thought of a scholarship interview might feel daunting. I’ve been there. For my JPA interview, I was nervous from the moment I woke up, knowing it was my first in-person interview. But then I realized something important: everyone else in that room was feeling the same nervousness. Recognizing this shifted my mindset—if we’re all feeling this, I don’t have to be perfect. Instead of letting nerves control me, I decided to make connections with other candidates. As it turned out, these were the same people in my interview session. That simple act of talking to them turned my anxiety into confidence, making the interview less intimidating.",
              "2. Be Prepared Like a Pro",
              "Preparation is your greatest ally. Go beyond surface-level knowledge and dive deep into the field of study you're passionate about. The more you know, the more you’ll stand out. When they ask, \"Why this field?\" your genuine interest will shine through. In today’s world, we have powerful tools at our disposal. For me, ChatGPT was a game-changer. It helped me gather relevant insights and broaden my understanding in ways that traditional research couldn’t.",
              "3. Practice Until It's Second Nature",
              "You've heard it before, but let me emphasize—practice is the key to mastering your speaking skills. The more you practice, the smoother you'll be, the fewer pauses you’ll make, and the faster you’ll recover from slip-ups. My friends played a crucial role, helping me with mock interviews. If you don’t have a practice partner, use your parents or even a mirror. The goal is to transform nervousness into self-assurance through repetition.",
              "4. Stay Humble, Stay Grounded",
              "Finally, humility goes a long way. Be confident but not arrogant. When you speak with purpose and passion, while staying true to yourself, interviewers notice. Confidence without humility can come off as overbearing, but when you balance both, you’re seen as someone with strong character and genuine intent."
            ]
          }
        ]
      },
      {
        "contributorName": "Rory Mae Stanley",
        "contributorImage": "/assets/portrait/Rory.jpeg",
        "intendedCourse": "Medicine",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "gburory",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "No scholarship interviews."
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "In my opinion, the most crucial element to focus on during the BCNS application process is your academic plan and future career goal. You are expected to decide what course you intend to study and where to study it because KYS will not decide any of that for you. For example, if you want to take an A-level course at a certain college, you are expected to apply for that college independently. The scholarship will be effective after the college admission."
            ]
          },
          {
            "title": "Advice and Tips to share to your juniors",
            "content": [
              "BCNS might not offer a grand allowance, but this scholarship is still ideal for those scholars who want to be independent on their academic path and career goals.",
              "Lastly, to all future BCNS scholars who are planning to study at KYUEM, here are my advice and tips for you:",
              "(a) College admission",
              "Although applying for college is your responsibility, don’t worry, KYS will help and guide you throughout the process. You can apply online by sending your application form to KYUEM Student Service via email at ss@kyuem.edu.my",
              "(b) Coursebook cost",
              "For your information, the book allowance for BCNS is RM300 per year. However, a brand-new A-Level coursebook can cost more than RM300 each. If you can’t afford it, you may use the free digital version. You can also buy second-hand books from seniors, however, it’s on a first come first serve basis. WhatsApp groups such as KY Book Sales are one of the platforms that I use to buy second-hand books.",
              "(c) Transportation cost",
              "During my first month in KYUEM, I spent more on transportation fare than food or books. Although BCNS provide a flight ticket allowance of RM800 per year, please bear in mind that you will not get this allowance in the early month of the first semester. Therefore, you need to bear all the transportation costs during college registration day, which is a flight ticket from Sabah to Selangor plus taxi or Grab fare from the airport/hotel to KYUEM. KYUEM is a bit far from Subang or KLIA Airport, so taking a taxi or Grab can cost you around RM100-RM150 per trip. However, after the registration day, you can book KYUEM transport service for cheaper transport fare to the city. Another important thing to highlight is that for those who don’t have family or close relatives in Selangor, please allocate some money to buy flight tickets to go back home during the mid-semester break because you cannot stay at the college during the compulsory leave. For example, I registered in KYUEM on 20th August 2024. Then after 3 weeks, I had to go back home to Sabah for two weeks because of the compulsory leave. So, technically for the first month of studying at KYUEM, I had spent around RM2000 for the transportation fees alone."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "ytn",
    "name": "Tenaga Nasional Berhad (TNB) Prime Scholarship Biasiswa Terkemuka Luar Negara",
    "shortName": "TNB PRIME",
    "description": "Yayasan Tenaga Nasional (YTN), which was established as a trust body for TNB, continues to ensure that the company’s corporate social responsibility initiatives and efforts are met through scholarships and study loans to deserving students. Yayasan Tenaga Nasional continues to play its role in disbursing financial assistance and scholarships to help outstanding and deserving students further their studies in institutions of higher learning both locally and abroad.",
    "logoPlaceholder": "/assets/company_logos/TNB_logo.jpg",
    "scholarshipLevel": "global",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Able to express yourself fluently and be open to everything",
        "Strong leadership skills and active participation in extracurricular activities such as societies and clubs, sports."
      ],
      "academicQualifications": [
        "Obtained a minimum of 8A’s (combination of A and A+) in the recent SPM examination",
        "Not exceeding 18 years of age at the enrollment date for the foundation studies"
      ]
    },
    "requiredDocuments": [
      "SPM result",
      "Co-curricular activities and Competition Certificates",
      "PAJSK Certificate"
    ],
    "coursesOffered": {
      "allowed": [
        "Chemical Engineering",
        "Environmental / Sustainability",
        "Accounting",
        "Electrical Engineering",
        "Data Science and Analytics",
        "Computer Science"
      ],
      "notOffered": [
        "Medicine",
        "Dentistry",
        "Educational Pharmacy",
        "Nursing",
        "Courses requiring licences such as aviation licences and professional courses such as ACCA and CLP"
      ]
    },
    "countriesOffered": [
      "Both Local and Global (Top 20 University in the world in AUS/ UK)"
    ],
    "bondingDetails": {
      "duration": "For the Year 2024 is the first batch to be bondless , not sure about the future whether they might change or not.",
      "workLocation": null
    },
    "applicationTimeline": {
      "startDate": "May 27, 2024",
      "endDate": "June 6, 2024",
      "note": "SPM result released: 27 May 2024. All documents and certificates must be submitted to Yayasan Pelajaran Johor office in Larkin, Johor Bahru before deadline."
    },
    "numberOfRecipients": {
      "previousYear": "around 25-30",
      "currentYear": 5
    },
    "applicationLink": "https://ytn.tnb.com.my",
    "generalInfoLink": null,
    "resultNotification": [
      "Via YTN socials, YTN sms, and YTN website"
    ],
    "applicationProcess": [
      {
        "stage": "Stage 1 : Register your account.",
        "details": "Search up the YTN website and make an account, proceed to login and fill up everything necessary.    ( Fill in before the deadline !!)",
        "tips": [
          "Fill in before the deadline !!"
        ]
      },
      {
        "stage": "Stage 2 :Verbal and Numerical Ability Test",
        "details": "You are going to sit for an English and Math test, where you have to complete a number of questions in a certain amount of time.",
        "tips": []
      },
      {
        "stage": "Stage 3 : Interview (1st Selection) with Personality and Moral Reasoning Test",
        "details": "Around 150 candidates will be selected and there will be a morning and afternoon session for the interview. Before entering the interview room, you will have to fill in some questions about your hobbies and how you would act in certain scenarios and which action you will most likely take.",
        "tips": []
      },
      {
        "stage": "Stage 4 : Interview (2nd Selection)",
        "details": "After the 1st Interview, there will be an announcement for those who are chosen to attend the 2nd interview. This interview is quite similar to the 1st interview, just that the interviewer is different.",
        "tips": []
      }
    ],
    "contactEmail": "infoytn@tnb.com.my",
    "contactNumber": "07-2344355",
    "scholars": [
      {
        "contributorName": "Lim Ethan",
        "contributorImage": "/assets/portrait/ethan_img.jpg",
        "intendedCourse": "Chemical Engineering",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "ethanoate_ion",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "1) Please introduce yourself.",
              "Ans: Hello everyone. I would like to thank everyone for providing me this opportunity to join this interview. My name is Lim Ethan, currently 18 years old. I'm from Melaka, coming from a family of 5, my parents and 2 younger sisters of mine. My hobbies include fencing, listening to music, singing and problem solving. I would say I excel in both academics and sports Achieving High Distinction award for the International Chemistry Quiz Award organized by the Royal Australian Chemical Institute. Besides, Achieving Distinction in Kuiz Kimia Kebangsaan Malaysia consecutive for 2 years which is 2022 and 2023 Kangaroo Mathematics and Kancil Science competition, silver bronze awards Champion award for Innovative Robotic Championship Competition Champion award for Olympiad Maths Competition at UTEM Got into Semi-Final in SUKMA fencing Competition 2022 Ranked 29 in Malaysia Open Fencing Competition Champion for State level epee fencing competition",
              "2) Why do you want this scholarship?",
              "Ans: First of all, in order to pursue further studies, I would need a lump sum of money to do so. But unfortunately, my parents still have to fund 2 of my sister's studies in the future. I would not want to be a cold-blooded brother and take away all their opportunities to allow them to shine. I will have to depend on this scholarship and lessen my parents' burden for my future education. Secondly, I have my own aims and goals in life. By getting this scholarship I am able to obtain a foundation for my knowledge in order to achieve what I desire, which acts as a stepping stone for me to make a positive impact to the whole world. Thirdly, this scholarship will provide me with an excellent pathway in order for me to explore and learn more. By providing me the knowledge that is necessary, I am able to continue learning from others and keep on improving myself in order to reach the peak and create a legacy that I have been aiming for.",
              "3) Why should we choose you? Why do you deserve this?",
              "Ans: Firstly, I have great leadership skills. During my secondary school, I was appointed as the Secretary for every club and society that I am involved in. For example, Prefectorial Board, Mathematics Club, St John Ambulance and Sports Club. The most challenging, yet the most exciting job for me is being the Secretary of the Prefectorial Board as with the name comes with great responsibility. My job as the Secretary is to be on stage in front of 1000 people every morning to make announcements and send back all the classes, sometimes being the emcee and organizing ceremonies and events and creating a duty list for all the prefects each week to ensure every inch of the school goes well in discipline. Secondly, I believe I uphold great communication skills. Guiding all the junior prefects was challenging but I enjoy it as looking at their performance fulfills me with joy and satisfaction as it means I executed my job well as a leader. This job truly elevated me by adapting, turning myself from an introvert to an extrovert, meanwhile not crossing boundaries and being respectful. Thirdly, I have a strong will which drives me and keeps me going, not allowing me to give up in honor of my brother, Eason. Getting this scholarship will be a great pathway for me in order to further my studies, keeping up my consistency in studies and solve each and every problem that I encounter with all the knowledge that I have learnt. In conclusion, I truly believe that I am able to cope and adapt with everything that comes in my way and achieve success no matter what or how."
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "Be true to yourself, keep calm as it's just an open conservation for them to get to know you better. Show them what you have and excel in it !!"
            ]
          },
          {
            "title": "Advice and Tips to share to your juniors",
            "content": [
              "1) Understand the vision and mission of TNB, align your goals with them as they would love to see their scholars shine in specific fields and contribute back to our beloved country.",
              "2) Express to them what you have interest in and do best in. Everyone has their specialty , you just gotta show it out ! Remember to express what you can and are planning to contribute to society.",
              "3) Being nervous is no exception, it's bound to happen. After all, it's an interview that gives you a once in a lifetime opportunity. What I personally do is just to breathe in deeply before entering the interview room. Upon looking at their cheerful faces you wouldn't feel nervous anymore.",
              "4) Prepare a file with certificate with all your achievements in it to present to them during the interview."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "ykgs",
    "name": "Yayasan Khazanah Global Scholarship",
    "shortName": "Yayasan Khazanah",
    "description": "Yayasan Khazanah is a foundation under Khazanah Nasional Berhad, the sovereign wealth fund of Malaysia, aiming to grow long-term wealth for the nation. The Khazanah Global Scholarship provides opportunities for bright Malaysians to pursue A-Level studies at Kolej Yayasan UEM and undergraduate studies at leading global universities. Scholars are also provided with leadership training and job attachments at leading organizations in Malaysia.",
    "logoPlaceholder": "/assets/company_logos/khazanah.jpg",
    "scholarshipLevel": "global",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Possess strong leadership skills and active participation in extra-curricular, social, or voluntary activities.",
        "Obtained a minimum of 8A+/As in the recent SPM examination, including Bahasa Melayu, English, History, and Mathematics, or at least 8As in the recent IGCSE.",
        "Not exceeding 18 years of age at the enrollment date for the foundation studies."
      ],
      "academicQualifications": [
        "Applicants must demonstrate consistent and outstanding academic achievement.",
        "SPM and Form 4 results are mandatory, while forecast and trial results are optional."
      ],
      "additionalCriteria": [
        "Participation in national or international competitions is an added advantage.",
        "Ability to demonstrate a commitment to nation-building."
      ]
    },
    "requiredDocuments": [
      "SPM results.",
      "Certificates of extra-curricular activities.",
      "Parents or guardians' salary slips or EA Form. If self-employed or unemployed, provide latest financial statements or other supporting documents.",
      "Passport-size photo taken within the last 6 months.",
      "Certified true copies of applicants' and parents' identity cards (IC)."
    ],
    "coursesOffered": {
      "allowed": [
        "Arts and Humanities (e.g., Philosophy, History, Linguistics, Art and Design)",
        "Engineering and Technology (e.g., Computer Science, Chemical Engineering, Civil Engineering)",
        "Life Sciences (e.g., Biological Science, Psychology, Agriculture)",
        "Natural Sciences (e.g., Chemistry, Geography, Mathematics, Material Science)",
        "Social Sciences (e.g., Accounting and Finance, Sociology, Law, Business Management)"
      ],
      "notOffered": [
        "Medicine",
        "Dentistry",
        "Veterinary Medicine",
        "Petroleum Engineering"
      ]
    },
    "countriesOffered": [
      "United Kingdom",
      "United States",
      "Australia",
      "Canada",
      "China"
    ],
    "bondingDetails": {
      "duration": "1-to-1 ratio of study period to working years",
      "workLocation": "GLCs, GLICs, or government agencies under Khazanah Nasional Berhad"
    },
    "applicationTimeline": {
      "startDate": "May 20, 2024",
      "endDate": "June 5, 2024",
      "note": "Ensure application and supporting documents are submitted before the deadline."
    },
    "numberOfRecipients": {
      "previousYear": 24,
      "annually": 31
    },
    "applicationLink": [
      "https://www.yayasankhazanah.com.my/scholarship-programmes/khazanah-global-scholarship-programme"
    ],
    "generalInfoLink": null,
    "resultNotification": [
      "Results for each stage are sent via email.",
      "Applicants must reply to emails for further stages; failure to do so will result in disqualification."
    ],
    "applicationProcess": [
      {
        "stage": "Stage 1: Verbal and Numerical Test",
        "details": "Applicants are required to take advanced logiks numerical and verbal reasoning tests. Numerical tests involve data and chart analysis, while verbal tests focus on reading comprehension.",
        "tips": [
          "Logiks numerical is a test on your data and chart analysis skills which requires some simple math calculation. Make sure you have everything needed (calculator, notebook, pen, etc.) with you before starting the assessment. Although the calculation is not that difficult, time constraint is the biggest challenge as there is lots of information that needs to be processed in a short time. Try your best to complete each question in around 1 minute.",
          "Logiks verbal is a test on your reading skills and comprehension ability. You will be given 12 passages in various languages of your choice with 3 questions each passage. Try your best to complete each passage in around 2 minutes. Some questions are quite tricky so read carefully before you pick an answer.",
          "Before you start the test, make sure you try out some questions in the link given below. Questions are really similar to the Oxford Thinking Skills Assessment (TSA) tests. https://practicetests.cubiks.com/ability-tests/advanced"
        ]
      },
      {
        "stage": "Stage 2: Personality and Moral Reasoning Test",
        "details": "Applicants take the Cubiks Team Role Questionnaire, PAPI 3N, and Khazanah CRI to assess suitability.",
        "tips": [
          "There is nothing much to worry about this session. Just follow the instructions given by the assessment website and answer the questions honestly - Expect some real case scenario which you need to judge what is your reasoning behind an action",
          "This is not a matter of right or wrong, it is all about suitability. Applicants face the Cubiks Team Role Questionnaire, Cubiks PAPI 3N & Khazanah CRI",
          "https://www.practiceaptitudetests.com/testing-publishers/cubiks/",
          "https://practicetests.cubiks.com/personality-assessment/papi"
        ]
      },
      {
        "stage": "Stage 3: Assessment Centre",
        "details": "A physical session divided into a group case study and an individual interview.",
        "tips": [
          "Part 1 : Group Case study",
          "For the case study, you need to work with a group of 4 to 6 individuals playing the role of Legoland Malaysia CEOs. Collaborate to select candidates for 6 director vacancies. In the first half-hour, each of you will receive 2 CVs, and read them silently for 30 minutes.",
          "Then, you have 3 minutes each to present and suggest suitable positions for the applicants. You're provided with paper, pencil, and a calculator to jot down information shared by your peers.",
          "Finally, 20 minutes is allocated for group discussion to decide which candidates from the CVs should fill the vacancies, ensuring all positions are filled and the budget is sufficient. Then, 1 person would summarise the group discussion made which marks the end of the group case study. They would also ask each person their opinions and feedback on Khazanah interviews.",
          "Part 2: Individual Interview ( IN STAGE 3, GENERALLY ONLY TALKING ABOUT YOUR PAST )",
          "They really focus on your PAST experiences, talking about your achievements, your competitions, your roles and responsibilities in school. They would also ask questions from your essay, so be sure to know everything about what you wrote in your essay."
        ]
      },
      {
        "stage": "Stage 4: Interview with YK Management",
        "details": "Almost similar with stage 3 individual interview but it was held online. Although it is individual interview, you will still be divided into groups.",
        "tips": [
          "The interviewers will ask a few questions and each of you will take turn to answer the questions.",
          "If you are too anxious to be the first one, don't worry and let others to talk first. It does not matter whether you talk first or last.",
          "The questions asked is generally related your intended course, what makes you unique as well as your highest achievement.",
          "Talk about something that is more special apart from academic success. And also, they might ask about your career goals in their company."
        ]
      },
      {
        "stage": "Stage 5: Interview with YK Trustees",
        "details": "Finally, you have reached the final stage. Here, the interview process is similar to stage 4 where each of you take turns to answer questions.",
        "tips": [
          "The difference between stage 4 and stage 5 is just the type of questions asked.",
          "Expect some personal-based questions including your family, your hobby and your passion.",
          "Just tell about how all of these shaped you and make you a better person.",
          "Be sure to not be too static and professional, and do be more personal with the Trustee, it is good to show personality."
        ]
      }
    ],
    "contactEmail": "ykselect@yayasankhazanah.com.my",
    "contactNumber": null,
    "scholars": [
      {
        "contributorName": "Jordan Lee Fur Yuan",
        "contributorImage": "/assets/portrait/jordan.jpg",
        "intendedCourse": "Civil Engineering",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "jordan_lfy",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "ESSAY. Be honest in your essay, and also make sure your essays shows REFLECT. I think it's important in YK becuase in STAGE 3, 4 & 5, they always read your essay before interviewing you, your essay would be your first impression towards the interviewer. In your INTERVIEW, speak confidently (YK USUALLY LIKE PEOPLE WHO ARE VOCAL, AND REALLY SHOW LEADERSHIP QUALITIES in their answers). Always feedback strongly."
            ]
          },
          {
            "title": "Advice and Tips to share to your juniors",
            "content": [
              "i) Show leadership qualities in your answers ",
              "YK wants future leaders, so speak confidently with poise and be sure to put your ideas forwards ",
              "ii) Nation building mindset",
              "Having this mindset does not mean you will get the scholarship, but it does do you good to set some intentions right. You are the person that you are today, because of the people & community that has shaped you. Be sure to include how involvement in their company can even better improve yourself as a person and a future leader. ",
              "iii) Prepare ",
              "company knowledge (especially in your respective fields) so that you can talk about it",
              "Data and stuff happening around MALAYSIA and the world so you can use it as an example or case study for your answer ",
              "Find past scholars to get their opinions and listen to the questions they get, so you can better prepare for the questions before you interview"
            ]
          }
        ]
      },
      {
        "contributorName": "Phuah Jun Xi",
        "contributorImage": "/assets/portrait/junxi.jpg",
        "intendedCourse": "Electrical & Electronics Engineering",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "junxi.py",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "1. How do you overcome life problems, stress, and manage time effectively?",
              "2. Describe an event that showcased your leadership qualities.",
              "3. Where do you see yourself in 5 years, 10 years?",
              "4. How would you contribute to Malaysia?"
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "Relax and don’t forget to smile!"
            ]
          },
          {
            "title": "Advice and Tips to share to your juniors",
            "content": [
              "Take it as a conversation and express your thoughts genuinely."
            ]
          }
        ]
      },
      {
        "contributorName": "Low Cheng Xian",
        "contributorImage": "/assets/portrait/chengxian.jpg",
        "intendedCourse": "Aeronautical Engineering",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "chengxian.low",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "1. Describe an event that showcased your leadership qualities.",
              "Ans: During last August, my school Chinese language teacher plan to organise a Kedah state level Chinese Language Carnival. Therefore, she selected a student committee to ensure the event can be run smoothly and I am honoured to be chosen as the advisor of the committee. The event is mainly made up of two parts which is the first one, a calligraphy competition, and second one, a quiz competition. Let me just share about my role in the second part. While the quiz competition committee came out with the questions, I am responsible to check for the quality of the questions. This is my first time to hold a position as advisor, so there are a few miscommunications that cause the questions don't meet the standards required by the teacher. Luckily, after I coordinated with the committee and came out with a clearer instruction, we managed to finalise the questions and the teacher is happy with that. After all hard work, the event was a total success and most importantly, I have learnt how to communicate effectively with others and be a better leader. ",
              "2. What is your intended course and why?",
              "Ans: I would like to study aeronautical engineering. I have been a fan of a documentary series, named Air Crash Investigation. From this documentary, I am astonished by the highly sophisticated structure of an aircraft and how much details are needed to ensure a plane can fly safely. Even one single miscalculation or oversight that seems to be a minor error could lead to a catastrophic disaster. Although these kinds of disaster are heartbreaking, it is important for us to learn from these incidents so that everyone can fly safely. Therefore, I started to think that I would like to pursue a career related to aviation technology. It is not only because I love to solve complex problems, but also due to my passion to contribute to the improvement of this industry. For me, aviation technologies are not all about flying faster and faster. In fact, innovations on how we can make an airplane safer should be prioritised before we think about catching up the speed of sound and even light.",
              "3. What makes Khazanah Scholarship unique compared to others?",
              "Ans: Khazanah scholarship absolutely stands out from others when I am doing research on scholarships. One of the most significant features is the variety of courses offered. I am really surprised that most of the courses that I can think of are indeed offered by YK, including the one that I am planning to study, which is aeronautical engineering. I can't find courses like this any other scholarship. Furthermore, Khazanah also provide leadership trainings and job attachments in some of the nation's best organisations upon graduation. For me, these experiences are important to build a strong interpersonal skill as well as providing an opportunity to put what I have learnt into practice. Just like me, who planned to study aeronautical engineering, I am looking forward to entering one of Khazanah's selected portfolio companies, which is Malaysia Aviation Group. I am sure that I can learn something more extraordinary rather than just theory from the professionals there. All in all, Khazanah scholarship is exceptionally well in building talented and well-rounded leaders in Malaysia.",
              "4. Have you ever disagreed with a teacher? How did you solve it?",
              "Ans: Yes, I have once disagreed with my Chemistry teacher. It was during Form 4 when I received my Chemistry year end examination results. There is one essay question where I wrote something that is out of syllabus and the teacher did not award me some marks. I am pretty sure that what I had written is correct because I read it somewhere in a scientific journal. I tried to discuss with that teacher whether the answer is accepted. After doing some simple searching, we found out that the answer is indeed correct, but it somehow contradicts with the textbook used. Therefore, the teacher is unable to award any extra marks for that answer and I agreed with the teacher's decision. The teacher suggested me to answer the exams based on what is in the textbook because that is where the answer scheme is constructed. Since on, I tried my best to stick to the textbook when answering the questions in exam and keep what I have learnt outside the syllabus to myself.",
              "5. What makes you different from other candidates?",
              "Ans: I think what really set me apart from other candidates is that I have a deep passion in engineering field. I always enjoy reading scientific journals as well as watching documentaries in order to know more about the engineering approaches that is used to solve current issues nowadays including global warming and so on. On top of that, my passion has driven me to seek for an exciting industrial experience. After I finished my SPM examination, I managed to find a part time job in a local technology company, which is ViTrox Corporation Bhd with the help of my sister. During that period, I am exposed to some of the current technologies especially electronics and AI. What I need to do during the job is actually classify and process the input data that will be fed to AI for machine learning. It is not only the job that I have done excites me, but also what I have learnt that impact my thought. From this experience, I started to wondering on how are these related to my intended course. After some searching and reading, I am happy to find out some similarities and connections between these technologies that I am exposed to during the job with avionics in aircraft that power some crucial systems including autopilot. "
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "Be yourself and be confident in yourself.",
              "Be genuine and never lie on any of the questions.",
              "Take time to understand the questions before responding to it. It is not that you must answer the questions immediately after it is asked, take a short time to recall and think properly before you talk.",
              "Learn how other candidates speak during interviews and try to improve yourself from that. ",
              "Make new friends and enjoy the interview process. You will meet a lot of lovely and kind person including your peers as well as the interviewers."
            ]
          },
          {
            "title": "Advice and Tips to Share with Your Juniors",
            "content": [
              "Research Yayasan Khazanah thoroughly.",
              "Study your intended course and its importance to Malaysia’s development.",
              "Give clear examples and evidence to support your answers rather than just talking generally.",
              "Use the STAR method to help you elaborate your answers, especially when you are asked about your experiences:",
              "S: Situation - What is the situation you faced?",
              "T: Task - What are your tasks or responsibilities?",
              "A: Action - Give a clear flow of what you have done.",
              "R: Results - Don't just talk about what you achieved, but also how it changed or shaped you/made you better.",
              "Focus on your personal development and growth.",
              "Keep up-to-date with recent global and local issues and think critically about solutions.",
              "It's just a matter of suitability, not ability, so don't be sad if you don't get it. Just enjoy it as a part of learning. Wish you all the best!"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "fgv-scholarship-programme",
    "name": "FGV Scholarship Programme",
    "shortName": "FGV",
    "description": "The FGV Scholarship Programme 2024 offers Malaysian students the opportunity to pursue undergraduate studies at reputable higher learning institutions. The scholarship supports students in various fields, including Accounting & Finance, Business Management & Economics, Engineering, and more. This programme not only provides financial support but also nurtures leadership and academic excellence, preparing scholars for a successful future in their chosen professions.",
    "logoPlaceholder": "/assets/company_logos/FGV_logo.png",
    "scholarshipLevel": "global",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Achieved a minimum of 8A’s in the recent SPM examination",
        "Must be a Malaysian citizen.",
        "Not exceeding 18 years of age at the time of application.",
        "Demonstrated strong leadership qualities by actively holding leadership positions in extracurricular activities, such as student councils, clubs, or societies. Applicants should showcase their ability to lead teams, organize events, and make impactful contributions in areas like sports, community service, or school-based initiatives."
      ]
    },
    "requiredDocuments": [
      "SPM results",
      "Certificates (you are recommended to bring your physical certificates during the first and final interview stages)",
      "Candidate’s and Parents’ IC",
      "Parents’ or Guardians’ salary slips or EA form"
    ],
    "coursesOffered": [
      "Accounting & Finance",
      "Agriculture & Agronomy",
      "Business Management & Economics",
      "Engineering & Automation",
      "Environment, Social & Governance",
      "Food Science & Technology",
      "Hospitality",
      "Information & Technology",
      "Logistics Supply Chain",
      "Science & Statistics"
    ],
    "bondingDetails": {
      "duration": "10 years",
      "workLocation": "FGV Holdings Berhad"
    },
    "applicationTimeline": {
      "startDate": "May 21, 2024",
      "endDate": "June 15, 2024"
    },
    "numberOfRecipients": {
      "2024": 3
    },
    "applicationLink": "No specific application link available at the moment. My advice would be to keep track of the latest scholarship updates from trusted sources.",
    "resultNotification": [
      "Shortlisted candidates receive an email with details on the first round of assessment (date, time, venue, dress code).",
      "RSVP your attendance by the deadline.",
      "The number of shortlisted candidates can vary each year; during my time, only 60 out of 5,600 applicants were selected for the first round.",
      "After the assessment, FGV will call you (keep your phone on) and send an email confirming if you’ve been selected for the final interview at Wisma FGV.",
      "Two days after the final interview, you’ll receive another phone call if you’re chosen as a scholar.",
      "The timeline and process may vary depending on the year and individual circumstances."
    ],
    "applicationProcess": [
      {
        "stage": "Stage 1: Online Application",
        "details": "You will need to provide your SPM results and extracurricular activities. Be mindful of your responses, as the final interview will include a presentation about you based on this information. For example, if you include swimming as an activity, assessors may ask how it shaped you beyond discipline and time management.",
        "tips": [
          "Ensure your SPM results and extracurricular activities are accurate and well-documented.",
          "Think critically about how each activity reflects your personal growth beyond surface-level qualities.",
          "Prepare to articulate how your experiences have shaped your skills and values."
        ]
      },
      {
        "stage": "Stage 2: First Round of Assessment at AC Hotel Kuala Lumpur",
        "details": "This consists of three parts: Game-Based Assessment, Group Interview, and Individual Interview. \n\nGame-Based Assessment: You will be divided into pairs and asked to solve a puzzle within a time limit. Some of your puzzle pieces will be swapped with those from other groups, so you will need to negotiate for your missing pieces. Afterward, you’ll answer questions like 'How did you arrive at your solutions?', 'Could you have solved the puzzle faster?', and 'How did you decide your roles in the group?'. \n\nGroup Interview: You’ll be divided into groups of three and given a question to discuss for 15 minutes, followed by a 30-minute presentation. Topics range from fast fashion to AI. After the presentation, assessors will ask questions related to your topic and personal experiences like 'Share a time when you miscommunicated' and 'How do you communicate with people from different generations in the workplace?'. \n\nIndividual Interview: Two assessors will ask personal questions about your extracurricular activities and company-related topics. Before the interview, you will solve a puzzle. Questions you might encounter include 'What is your preferred course and university?' and 'Would you accept the scholarship if we sent you to the UK instead of the USA?'.",
        "tips": [
          "Communicate effectively during the assessments and group discussions.",
          "Structure your answers and presentations clearly with logical flow and examples.",
          "Familiarize yourself with your extracurricular activities and prepare to discuss personal experiences."
        ]
      },
      {
        "stage": "Final Interview",
        "details": "The final round involves a panel of senior management. A presentation about you will be shown, and the panel will ask questions related to the departments they oversee.",
        "tips": [
          "Pay attention to instructions and stay calm under pressure.",
          "Use personal experiences in your answers to demonstrate your unique qualities.",
          "Conduct thorough research on FGV, and don’t justify incorrect answers if corrected."
        ]
      }
    ],
    "contactEmail": "",
    "scholars": [
      {
        "contributorName": "Marissa Dhaniyah binti Ahmad Danis",
        "contributorImage": "/assets/portrait/Marissa.jpeg",
        "intendedCourse": "Data Science",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "m4riss4_dhaniyah",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImages": [
          "/assets/resume/marissa_resume.jpg"
        ],
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "1. Do you have any experience in leadership? Tell me more about it.",
              "In my role as a project manager for Malam Ambang Merdeka, there was a time when my team was understaffed, leading to workload accumulation. Besides encouraging my team and establishing trust that we would meet the deadlines, I engaged in a comprehensive discussion with the management team about improvements we could implement. I delegated tasks to each individual according to their strengths and established a timeline for completion while keeping my teacher informed. In the end, the event went smoothly, the audience had fun, and we received great feedback from the principal. I learned how important open communication and adaptability are in a group project.",
              "2. Tell me about your strengths and weaknesses as an individual.",
              "Strengths: I am driven by a strong sense of responsibility for achieving goals. I believe in taking full ownership of my tasks and delivering on expectations with diligence and determination. I am confident that with persistence and hard work, I can overcome challenges and successfully meet objectives, no matter how difficult they may seem.",
              "Weaknesses: I am currently working on developing my sense of humour. In professional settings, I tend to be quite serious, and I recognize the need to lighten the atmosphere at times. I am actively learning to inject more humour and positivity into my interactions, understanding that not everything needs to be approached with solemnity.",
              "3. What do you know about the FGV Holdings Berhad?",
              "Ans: FGV Holdings Berhad is a Malaysian-based agricultural company, one of the world's largest producers of crude palm oil. Founded in 2007 and listed on Bursa Malaysia in 2012, it was initially a commercial arm of the Federal Land Development Authority (FELDA). The company rebranded from Felda Global Ventures Holdings Berhad to FGV Holdings Berhad in 2018. Primarily involved in oil palm cultivation and processing, as well as refining and producing products like cooking oil and margarine. Engages in rubber plantations, sugar production (via MSM Malaysia Holdings Berhad), logistics, manufacturing, IT, and renewable energy. Operates in countries like Indonesia, Thailand, Cambodia, and several African nations."
            ]
          },
          {
            "title": "What Do You Believe is the Most Crucial Element to Focus On During the Scholarship Interview or Application Process?",
            "content": [
              "1. Mindset is crucial! Do not view these interviews as a measure of your worth—if you succeed, it doesn’t make you amazing, and if you are rejected, it doesn’t make you a failure. Instead, see them as opportunities to meet new people and gain valuable experience.",
              "2. Thoroughly research the companies where you will be interviewing, especially FGV, as they often ask numerous questions related to their organization.",
              "3. Discuss extracurricular activities that you are familiar with or passionate about, so you can elaborate on your answers without struggling.",
              "4. Pay attention to your body language. Maintain eye contact and use voice projection to convey confidence.",
              "5. Emphasize teamwork. It’s important to work well with your teammates and ensure that you reach the same conclusions."
            ]
          },
          {
            "title": "Advice and Tips to Share with Your Juniors",
            "content": [
              "Get involved in a variety of extracurricular activities during high school to gain diverse experiences you can discuss during interviews. It can be monotonous to repeat the same answer for every question. You don’t need to excel in every activity; what matters most is what you learned along the way and how you overcame obstacles during these experiences.",
              "Seek help from your seniors and parents (or others with more experience). Many seniors have already gone through this process and have valuable insights to share. Don’t hesitate to approach them for guidance. (I reached out to three of my seniors for three different interviews, and I was accepted by all three!)",
              "When answering questions, structure your responses by addressing:",
              " What I did (the activities I participated in)",
              " What happened (the challenges I faced)",
              " How I solved the problem",
              " What I learned from the experience",
              "Build a strong support system! The scholarship application process can be daunting, with multiple interviews often scheduled in the same week. Be prepared mentally and emotionally. Remember that you are not alone in this journey, and always seek help if you need it.",
              "Dream big, and all the best! If you need any help or specific interview advice for FGV, feel free to reach out to me on Instagram @m4riss4_dhaniyah!"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "ytm",
    "name": "Yayasan Telekom Malaysia",
    "shortName": "YTM",
    "description": "Yayasan TM (YTM) is proud to be a catalyst towards future-building for deserving Malaysian students. By pairing education and career development under the same umbrella, we equip individuals with the necessary knowledge and skills to thrive in a constantly changing environment. As a trusted partner in nation building, YTM remains committed to developing leaders of tomorrow who will drive our digital economy and Industrial Revolution 4.0.",
    "logoPlaceholder": "/assets/company_logos/YTM_logonew.png",
    "scholarshipLevel": "global",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Able to express yourself fluently and be open to everything",
        "Strong leadership skills and active participation in extracurricular activities such as societies and clubs, sports."
      ],
      "academicQualifications": [
        "Obtained a minimum of 8 A’s (combination of A and A+) in the recent SPM examination",
        "Not exceeding 21 years old in year of application",
        "Malaysian citizens and with good health condition",
        "Active in co-curricular activities"
      ],
      "additionalCriteria": [
        "Participate in diverse types of extracurricular activities"
      ]
    },
    "requiredDocuments": [
      "SPM result certificate",
      "Co-curricular activities and Competition Certificates",
      "PAJSK Certificate",
      "School Leaving certificate",
      "Parents' or Guardians' salary slips and EA form",
      "Student's and Parents' IC copy",
      "* All copies must be certified (CTC)"
    ],
    "coursesOffered": {
      "allowed": [
        "Technology & Digital",
        "Computer Science",
        "Creative Multimedia",
        "Management",
        "Engineering"
      ],
      "notOffered": [
        "Medicine",
        "Dentistry",
        "Educational Pharmacy",
        "Nursing",
        "Courses requiring licences such as aviation licences and professional courses such as ACCA and CLP"
      ]
    },
    "countriesOffered": [
      "Both. Usually the United States or United Kingdom but YTM also sends their students to France, Germany, Korea, Japan, or Australia."
    ],
    "bondingDetails": {
      "duration": "Serve for 5 years for local students and 7 years for overseas students if hired by TM Group",
      "workLocation": "Any government agency or GLC related to Johor government (could be in any state and not necessarily in Johor)."
    },
    "applicationTimeline": {
      "startDate": "May 27, 2024",
      "endDate": "June 6, 2024",
      "note": "SPM result released: 27 May 2024. All documents and certificates must be submitted to Yayasan Pelajaran Johor office in Larkin, Johor Bahru before deadline."
    },
    "numberOfRecipients": {
      "total": 190,
      "global": 8,
      "local": 182
    },
    "applicationLink": "https://ytm.tm.com.my/scholarships-future-leader#future_leaders_scholarship",
    "generalInfoLink": "https://ytm.tm.com.my/about-us#contact_form",
    "resultNotification": [
      "Application status can be checked through the website provided after application",
      "Application status may also be updated through email or phone message so check your email often"
    ],
    "applicationProcess": [
      {
        "stage": "Stage 1 : Register your account.",
        "details": "Search up the YTN website and make an account, proceed to login and fill up everything necessary. (Fill in before the deadline !!)",
        "tips": [
          "Fill in before the deadline !!"
        ]
      },
      {
        "stage": "Stage 2 :Verbal and Numerical Ability Test",
        "details": "You are going to sit for an English and Math test, where you have to complete a number of questions in a certain amount of time.",
        "tips": []
      },
      {
        "stage": "Stage 3 : Interview( 1st Selection ) with Personality and Moral Reasoning Test",
        "details": "Around 150 candidates will be selected and there will be a morning and afternoon session for the interview. Before entering the interview room, you will have to fill in some questions about your hobbies and how you would act in certain scenarios and which action you will most likely take.",
        "tips": []
      },
      {
        "stage": "Stage 4 : Interview (2nd Selection )",
        "details": "After the 1st Interview, there will be an announcement for those who are chosen to attend the 2nd interview. This interview is quite similar to the 1st interview, just that the interviewer is different.",
        "tips": []
      }
    ],
    "contactEmail": "https://ytm.tm.com.my/about-us#contact_form",
    "contactNumber": "07-2344355",
    "scholars": [
      {
        "contributorName": "MUHAMMAD UMAR BIN MOHAMAD NADZRIE",
        "contributorImage": "/assets/portrait/Umar_img.jpeg",
        "intendedCourse": "Computer Science",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "muhmd.umr",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImages": [
          "/assets/resume/umar_resume1.jpg",
          "/assets/resume/umar_resume2.jpg"
        ],
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "1. Introduce yourself",
              "2. What do you know about our organisation?",
              "3. What is your opinion towards xxx?",
              "4. Why did you choose this course?",
              "5. What makes you deserve this scholarship?"
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "There is no specific thing that I would say they focus on but try to show your unique self that others don't have."
            ]
          },
          {
            "title": "Advice and Tips to share to your juniors",
            "content": [
              "Set a specific goal of what you are planning to do in the future",
              "Have a big dream especially on the university you are planning to go to",
              "Prepare yourself with the knowledge of the course that you are applying for"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "asean_pu1",
    "name": "ASEAN Scholarship for Malaysia (Pre-University 1)",
    "shortName": "ASEAN",
    "description": "The ASEAN scholarship, awarded by the Ministry of Education of Singapore, is for students from Malaysia joining Secondary 1, Secondary 3 or Pre-university 1 in selected Singapore secondary schools or junior colleges. Students will have opportunities to broaden their horizons and develop important skills such as leadership, communication and other life skills. For Pre-university 1, the scholarship will cover all school, examination, transport, allowance, and accommodation fees across the two years the student will spend studying for the Singapore-Cambridge GCE A-Level certificate. The scholarship is renewed each year based on the scholar’s performance in school.",
    "logoPlaceholder": "/assets/company_logos/ASEAN_logo.png",
    "scholarshipLevel": "global",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Malaysian nationals who fulfil all the following conditions:",
        "Are born on 2 Jan 2007 to 1 Jan 2010.",
        "Are currently in Form 5 (or similar) or have taken the 2023-2024 SPM / GCE O-Level examination.",
        "Are proficient in English.",
        "Have done consistently well in school examinations.",
        "Have a good record of participation in co-curricular activities."
      ],
      "academicQualifications": null,
      "additionalCriteria": []
    },
    "requiredDocuments": [
      "The application asks for your school’s final year examination results for all subjects for the last two years. If you have taken the national examination or GCE O-Level examination during this period, enter those results instead of your school’s final year examination results.",
      "For instance, if you have taken the national examination this year, please enter your national examination results for this year and your school’s final year examination results for last year.",
      "Academic and non-academic awards and achievements, as well as your CCAs.",
      "Actual copies of the documents are only requested when shortlisted for the interview stage, including a scan of your identity document and examination results transcript."
    ],
    "coursesOffered": {
      "allowed": [
        "N/A, the scholarship leads to the Singapore-Cambridge GCE A-Level certificate or similar qualification."
      ],
      "notOffered": []
    },
    "countriesOffered": [
      "ASEAN countries excluding Singapore itself (the Malaysia scholarship is specifically for Malaysian students)"
    ],
    "bondingDetails": {
      "duration": "No bond whatsoever",
      "workLocation": null
    },
    "applicationTimeline": {
      "startDate": "Feb 10, 2025",
      "endDate": "June 9, 2025",
      "note": "Last for one month after SPM results released."
    },
    "numberOfRecipients": {
      "previousYear": "20+",
      "annually": "20+"
    },
    "applicationLink": [
      "https://form.gov.sg/612d8c5fccbd2e00120b2ce8",
      "https://tgs.moe.gov.sg/prog/AS-MY-PU1/"
    ],
    "generalInfoLink": null,
    "resultNotification": [
      "Via email",
      "They will inform you that you are shortlisted for attending an interview by the college’s admissions."
    ],
    "applicationProcess": [
      {
        "stage": "Stage 1: Online application",
        "details": "In the first stage, you will be filling out an online application form with information including your examination results, achievements and awards, and co-curricular activities.",
        "tips": []
      },
      {
        "stage": "Stage 2: Selection tests",
        "details": "You will be notified by email if you are shortlisted for the selection tests. You are going to sit for an English test (reading comprehension and writing), Math test, and aptitude or IQ test. All this will happen in one day at a designated venue, from morning to evening.",
        "tips": []
      },
      {
        "stage": "Stage 3: Selection interview",
        "details": "Based on my experience, the selection interview was held at the British Council in KL, with you speaking to the interviewers from MOE Singapore on ZOOM call on a computer in the building. It usually lasts 20 minutes, and the interviewers aim to gauge if you will be suitable to study in Singapore.",
        "tips": []
      }
    ],
    "contactEmail": "https://form.gov.sg/612d8c5fccbd2e00120b2ce8",
    "contactNumber": null,
    "scholars": [
      {
        "contributorName": "Tan Yi Xuan",
        "contributorImage": "/assets/portrait/Yi_xuan_img.PNG",
        "intendedCourse": "Philosophy, Politics & Economics (PPE)",
        "currentInstitution": "Kolej Yayasan UEM",
        "contactInformation": "xuannieyz",
        "currentStudies": "A-levels",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "1. Please introduce yourself.",
              "A: Name, age, where you're from, current institution, course intended to pursue, why this scholarship?",
              "2. Why that course of study?",
              "A: Philosophy, Politics & Economics (PPE), because it widens my understanding of the world. Avid interest in ethics and philosophy, partook in equality vs fairness research",
              "3. What role does your course of study play in society?",
              "A: Philosophy, Politics & Economics (PPE) helps us understand the world, helps with decision-making, governance, justice, finance, consulting etc.",
              "4. What are your weaknesses?",
              "A: I'm working on breaking out of my comfort zone, by not being afraid to speak to new people, and joining debate competitions.",
              "5. Tell me about a time you faced challenges in leadership?",
              "A: Referenced a time where two teammates had different approaches to a task and couldn't come to an agreement. Compared democratic and authoritative leadership; \"being too democratic isn't a good thing either\", a leader has the responsibility to make the best decision in the interest of the whole team, and any personal disagreements can be resolved privately.",
              "6. How do you deal with setbacks?",
              "A: Referenced a time when I scored horrendously low in a Mechanics surprise test, elaborated how I bounced back, highlighted how I don't tend to spiral when I face setbacks and instead think forward to how I can resolve the issue I am facing.",
              "7. co-curricular activities?",
              "A: Head Prefect of my school, secretary of school's Interact Club",
              "8. Why Singapore?",
              "A: System rewards hard work and merit, rigorous, awarding education, fosters good character values and transferable soft and hard skills etc.",
              "9. Any experience in boarding/living abroad?",
              "A: Flew to New Haven and stayed at Trumbull College of Yale University for two weeks for a summer residential program alone. Currently studying at KYUEM, a boarding college, returning home only every other week.",
              "10. How to resolve roommate issues?",
              "A: Communicate clearly and directly, set expectations early.",
              "11. What current world issue do you think young people today can have a hand in helping resolve?",
              "A: Israel-Palestine conflict. The youth have such a fire and determination in them for the causes that matter to them, and with the rise of social media they have been very vocal and adamant on seeing action and change in the world for the better. Channeling this passion and stubbornness for justice into the future when they rise into governmental or charitable work would make them able to make a change."
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "Your academic results, how you perform on the notoriously hard Math selection test that is rumoured to weed out the interviewees for the scholarship."
            ]
          },
          {
            "title": "Advice and Tips to share to your juniors",
            "content": [
              "1) Ace the selection tests.",
              "2) Be confident in your interview and smile.",
              "3) Provide examples and stories in your answers to the interview questions.",
              "4) Understand what you are getting yourself into by applying for the ASEAN Scholarship (i.e. boarding/living in Singapore, studying in Singapore, Singapore's education system and curriculum) -- understand that this is your choice and that YOU yourself want this scholarship and not your parents.",
              "5) Handle rejection with grace and a growth mindset.",
              "6) The interviewers love asking how you overcome challenges, and how you handle the responsibilities of leadership."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "scedu",
    "name": "Sin Chew Daily Education Fund",
    "shortName": "Sin Chew Daily",
    "description": "Sin Chew Daily Education Fund provides local undergraduate studies programmes to the candidates that hit their requirements. The main purpose of this scholarship is to aid needy students to further pursue their studies in local institutions.",
    "logoPlaceholder": "/assets/company_logos/sinchew_logo_new.png",
    "scholarshipLevel": "local",
    "eligibilityCriteria": {
      "mainCriteria": [
        "Not bonded or in receipt of any financial aid or rewards from other educational organisations or institutions.",
        "Students must possess good results in SPM /A-Level / STPM / UEC or other equivalent qualifications.",
        "Students must be active in sports and extra-curricular activities."
      ],
      "academicQualifications": [
        "The applicant must be a Malaysian citizen born on or after 1st January 1999.",
        "Trial Examination results do not qualify for the scholarship award.",
        "Each person is eligible to apply for 1 or 2 courses. If applying for 2 courses, the criteria are as follows:",
        "a) 2 different courses from 1 university/ college.",
        "b) 1 course from 2 different universities/ colleges."
      ],
      "additionalCriteria": [
        "Students must meet the minimum requirement set by the Colleges/ Universities in order to be qualified for selection.",
        "Different colleges, universities, and courses have different entry requirements. Please login to Sin Chew Daily Education Fund official website (https://scedufund.sinchew.com.my/) or liaise directly with the colleges or universities concerned for more details."
      ]
    },
    "requiredDocuments": [
      "SPM results",
      "Certificates",
      "Parents or guardians salary slips",
      "Electricity and water bills",
      "Identity Card",
      "Birth certificates"
    ],
    "coursesOffered": null,
    "countriesOffered": [
      "Local"
    ],
    "bondingDetails": {
      "duration": "No bonding",
      "workLocation": null
    },
    "applicationTimeline": {
      "startDate": "Immediately after SPM results released",
      "endDate": "1 month after SPM results released",
      "note": "Last for one month after SPM results released."
    },
    "numberOfRecipients": {
      "previousYear": null,
      "annually": null
    },
    "applicationLink": [
      "https://scedufund.sinchew.com.my/en/reference.php",
      "https://scedufund.sinchew.com.my/en/index.php"
    ],
    "generalInfoLink": null,
    "resultNotification": [
      "Via email",
      "They will inform you that you are shortlisted for attending an interview by the college’s admissions."
    ],
    "applicationProcess": [
      {
        "stage": "Stage 1: Application",
        "details": "Fill the application form and submit all the supporting documents. A short essay is required.",
        "tips": []
      },
      {
        "stage": "Stage 2: Interview",
        "details": "Interview will be conducted by the college’s admissions.",
        "tips": []
      }
    ],
    "contactEmail": "scedufund@sinchew.com.my",
    "contactNumber": null,
    "scholars": [
      {
        "contributorName": "Tung Pou Chong",
        "contributorImage": "/assets/portrait/pou_chong.jpeg",
        "intendedCourse": "Life Science",
        "currentInstitution": "Kolej Matrikulasi Selangor",
        "contactInformation": "pou.chong",
        "currentStudies": "Life Science",
        "motivationalQuote": null,
        "resumeImage": null,
        "stories": [
          {
            "title": "Mock-up Interview Questions and Your Answers",
            "content": [
              "1. Please introduce yourself?",
              "2. Tell me more about the course you are interested in.",
              "3. Did you apply for any other scholarship? If yes, which scholarship would you prioritize?"
            ]
          },
          {
            "title": "What do you believe is the most crucial element to focus on during the scholarship interview or application process?",
            "content": [
              "Focus on essay writing as it is the first impression that they will have on you, and that's the only way they evaluate candidates’ potency and eliminate the candidates.",
              "Next, during the interview, you must show your enthusiasm for the course that you are going to pursue and be steadfast with your choice and decision."
            ]
          },
          {
            "title": "Advice and Tips to share to your juniors",
            "content": [
              "Based on what I heard during the interview, this scholarship is almost fully funded by the college that you applied for. Thus, I can’t assure that every interview will be conducted the same as what I had experienced before.",
              "But according to my experience (BAC 1 year FIL, 3 years UOL LLB), they want you to be honest and put them on the top of your priorities list. They most likely will choose those who can surely contribute to their college, so better do more research thoroughly on the course and the college you applied."
            ]
          }
        ]
      }
    ]
  }
]